import React from "react";
import "./GubangPage.css"
import moment from "moment";
import ReactEcharts from "echarts-for-react";

let upColor = '#ec0000';
let downColor = '#00da3c';

let dataUrl = "https://ali-stock.showapi.com/realtime-k?";
let appCode = "APPCODE 9b138b2dbe0f4ee0a6ec170a0b77ac0e";

let listAllUrl = "https://admin.gbhome.com/api/v4/common/3in1/discovery?pageSize=10";
let listZlIdUrl = "https://admin.gbhome.com/api/v4/common/3in1/zlContent?pageSize=10";
let zlColorMap = {
    "独家研报": "tomato",
    "游资锦囊": "slateblue",
    "股帮研究院": "gold"
};
let zlIdMap = {
    1000003: "独家研报",
    1000004: "游资锦囊",
    1000007: "股帮研究院"
};
let allStockNames = ["平安银行", "万科A", "国农科技", "世纪星源", "深振业A", "全新好", "神州高铁", "中国宝安", "美丽生态", "深物业A", "南玻A", "沙河股份", "深康佳A", "*ST中华A", "深粮控股", "深华发A", "深科技", "深天地A", "特力A", "飞亚达", "深圳能源", "国药一致", "深深房A", "富奥股份", "大悦城", "深桑达A", "神州数码", "中国天楹", "华联控股", "深南电A", "深大通", "中集集团", "东旭蓝天", "中洲控股", "深纺织A", "泛海控股", "京基智农", "德赛电池", "深天马A", "方大集团", "皇庭国际", "深赛格", "华锦股份", "中金岭南", "农产品", "深圳华强", "中兴通讯", "北方国际", "中国长城", "华控赛格", "华侨城A", "特发信息", "海王生物", "盐田港", "深圳机场", "天健集团", "广聚能源", "中信海直", "TCL科技", "宜华健康", "中成股份", "丰原药业", "川能动力", "华数传媒", "中联重科", "常山北明", "国际实业", "申万宏源", "东方盛虹", "美的集团", "潍柴动力", "许继电气", "冀东水泥", "金融街", "双林生物", "长虹华意", "胜利股份", "*ST藏格", "ST地矿", "*ST沈机", "英特集团", "东旭光电", "渤海租赁", "民生控股", "合肥百货", "通程控股", "吉林化纤", "南京公用", "ST宜化", "东阿阿胶", "徐工机械", "兴业矿业", "华天酒店", "粤高速A", "张家界", "晨鸣纸业", "山东路桥", "鄂武商A", "绿景控股", "国新健康", "ST生物", "京粮控股", "中润资源", "珠海港", "*ST华塑", "新金路", "丽珠集团", "渝开发", "国际医学", "荣安地产", "四环生物", "中兵红箭", "长航凤凰", "长虹美菱", "广州浪奇", "岭南控股", "红太阳", "紫光学大", "柳工", "广弘控股", "冰山冷热", "穗恒运A", "华金资本", "顺钠股份", "万泽股份", "*ST华映", "广宇发展", "云南白药", "粤电力A", "中天金融", "佛山照明", "皖能电力", "中原环保", "金浦钛业", "金圆股份", "航天发展", "湖南投资", "江铃汽车", "创元科技", "靖远煤电", "安道麦A", "泰山石油", "神州信息", "西部创业", "莱茵体育", "万向钱潮", "我爱我家", "烽火电子", "陕国投A", "供销大集", "渝三峡A", "海南海药", "海德股份", "泸州老窖", "苏常柴A", "*ST大洲", "ST海马", "粤宏远A", "广东甘化", "威孚高科", "北部湾港", "哈工智能", "*ST东电", "汇源通信", "*ST金洲", "贵州轮胎", "启迪古汉", "太阳能", "平潭发展", "大通燃气", "*ST宝实", "古井贡酒", "东北制药", "兴蓉环境", "青岛双星", "建投能源", "韶能股份", "盛达资源", "渤海股份", "顺利办", "华媒控股", "阳光股份", "中迪投资", "西安旅游", "ST天首", "焦作万方", "大东海A", "京汉股份", "海航投资", "中油资本", "海螺型材", "新华联", "恒立实业", "吉林敖东", "长安汽车", "远大控股", "天茂集团", "高新发展", "攀钢钒钛", "铜陵有色", "顺发恒业", "三木集团", "合金投资", "英力特", "风华高科", "茂化实华", "万方发展", "西王食品", "仁和药业", "格力电器", "泰达股份", "金岭矿业", "金科股份", "中钨高新", "珠海中富", "长春高新", "*ST天夏", "*ST永林", "湖北广电", "经纬纺机", "美好置业", "荣丰控股", "*ST金鸿", "*ST盈方", "阳光城", "上峰水泥", "*ST当代", "智度股份", "恒天海龙", "襄阳轴承", "*ST友谊", "山推股份", "视觉中国", "东方电子", "远兴能源", "中山公用", "东北证券", "*ST华讯", "国城矿业", "宝新能源", "亚太实业", "惠天热电", "滨海能源", "炼石航空", "沈阳化工", "模塑科技", "厦门信达", "正虹科技", "恒逸石化", "浙江震元", "ST双环", "中信特钢", "河钢股份", "贝瑞基因", "京蓝科技", "锦龙股份", "丰乐种业", "中兴商业", "黑芝麻", "韶钢松山", "苏宁环球", "中原传媒", "新能泰山", "西安饮食", "湖南发展", "美锦能源", "京东方A", "鲁泰A", "*ST东科", "国元证券", "燕京啤酒", "四川美丰", "泰禾集团", "振华科技", "罗牛山", "中交地产", "ST南风", "航发控制", "普洛药业", "国海证券", "锌业股份", "*ST西发", "漳州发展", "山西路桥", "新华制药", "浩物股份", "中色股份", "中百集团", "*ST斯太", "本钢板材", "西藏矿业", "通化金马", "漳泽电力", "中航飞机", "广发证券", "中核科技", "新兴铸管", "甘咨询", "*ST平能", "美达股份", "长江证券", "居然之家", "北新建材", "北大医药", "万年青", "华神科技", "甘肃电投", "*ST盐湖", "华闻集团", "英洛华", "凯撒旅业", "中国武夷", "中水渔业", "酒鬼酒", "一汽解放", "四川九洲", "北京文化", "*ST北能", "*ST银河", "云铝股份", "铁岭新城", "创维数字", "冰轮环境", "陕西金叶", "德展健康", "美利云", "ST慧业", "航锦科技", "岳阳兴长", "*ST节能", "京山轻机", "山东海化", "超声电子", "太钢不锈", "启迪环境", "东莞控股", "天音控股", "鲁西化工", "五矿稀土", "粤桂股份", "*ST长动", "富通鑫茂", "*ST秦机", "财信发展", "中信国安", "承德露露", "华茂股份", "高鸿股份", "石化机械", "冀东装备", "五粮液", "国风塑业", "顺鑫农业", "海印股份", "银星能源", "三湘印象", "ST安凯", "张裕A", "吉电股份", "新希望", "天山股份", "云南铜业", "潍柴重机", "中广核技", "华联股份", "湖北能源", "城发环境", "海南高速", "中鼎股份", "峨眉山A", "中嘉博创", "*ST胜尔", "欢瑞世纪", "东凌国际", "双汇发展", "津滨发展", "鞍钢股份", "赣能股份", "现代投资", "航天科技", "新洋丰", "云内动力", "厦门港务", "浙商中拓", "景峰医药", "数源科技", "大亚圣象", "ST南糖", "泸天化", "钱江摩托", "山大华特", "电广传媒", "嘉凯城", "金陵药业", "南方汇通", "海信家电", "佳电股份", "河钢资源", "众合科技", "福星股份", "*ST夏利", "中钢国际", "兰州黄河", "中粮科技", "中关村", "华菱钢铁", "神火股份", "四川双马", "华西股份", "冀中能源", "紫光股份", "*ST凯迪", "南天信息", "新乡化纤", "重药控股", "中国重汽", "广济药业", "*ST河化", "欣龙控股", "中通客车", "东方能源", "首钢股份", "锡业股份", "中南建设", "东方钽业", "华东医药", "天保基建", "长源电力", "盈峰环境", "蓝焰控股", "安泰科技", "中科三环", "*ST高升", "ST中基", "佛塑科技", "银泰黄金", "华铁股份", "浪潮信息", "桂林旅游", "*ST众泰", "*ST银亿", "*ST中绒", "西山煤电", "大庆华科", "越秀金控", "华工科技", "九芝堂", "诚志股份", "闽东电力", "*ST皇台", "中国中期", "新大陆", "隆平高科", "华润三九", "宗申动力", "招商港口", "豫能控股", "招商积余", "招商公路", "招商蛇口", "新和成", "鸿达兴业", "伟星股份", "华邦健康", "*ST德豪", "精功科技", "华兰生物", "大族激光", "天奇股份", "传化智联", "盾安环境", "凯恩股份", "中航机电", "永新股份", "协鑫能科", "世荣兆业", "东信和平", "亿帆医药", "京新药业", "ST中捷", "科华生物", "海特高新", "苏宁易购", "航天电器", "山东威达", "分众传媒", "思源电气", "七匹狼", "达安基因", "巨轮智能", "苏泊尔", "丽江股份", "旺能环境", "华帝股份", "联创电子", "保利联合", "双鹭药业", "黔源电力", "南京港", "登海种业", "华孚时尚", "兔宝宝", "美年健康", "国光电器", "轴研科技", "宝鹰股份", "宁波华翔", "紫光国微", "三花智控", "中工国际", "*ST同洲", "云南能投", "德美化工", "得润电子", "横店东磁", "中钢天源", "威尔泰", "云南旅游", "粤水电", "浙江交科", "宏润建设", "远光软件", "华峰氨纶", "东华软件", "瑞泰科技", "景兴纸业", "黑猫股份", "獐子岛", "*ST长城", "ST凯瑞", "软控股份", "国轩高科", "沙钢股份", "*ST雪莱", "*ST大港", "太阳纸业", "苏州固锝", "中材科技", "金螳螂", "万邦德", "孚日股份", "海鸥住工", "万丰奥威", "*ST东洋", "新野纺织", "鲁阳节能", "ST新海", "金智科技", "江苏国泰", "中泰化学", "国脉科技", "青岛金王", "生意宝", "南岭民爆", "山河智能", "浔兴股份", "海翔药业", "天康生物", "广东鸿图", "ST冠福", "广博股份", "恒宝股份", "信隆健康", "莱宝高科", "沃华医药", "沧州明珠", "兴化股份", "三钢闽光", "威海广泰", "三变科技", "*ST天润", "罗平锌电", "三维通信", "中国海诚", "东港股份", "紫鑫药业", "康强电子", "韵达股份", "*ST科陆", "*ST天马", "梦网集团", "天邦股份", "湘潭电化", "银轮股份", "南极电商", "露天煤业", "中环股份", "沃尔核材", "利欧股份", "恒星科技", "广宇集团", "天津普林", "东南网架", "安纳达", "麦达数字", "顺络电子", "拓邦股份", "东华科技", "贤丰控股", "宁波银行", "宏达高科", "中核钛白", "荣盛发展", "*ST新光", "北纬科技", "西部材料", "通润装备", "北斗星通", "广电运通", "石基信息", "报喜鸟", "湖南黄金", "通富微电", "正邦科技", "汉钟精机", "三特索道", "常铝股份", "远望谷", "悦心健康", "海南发展", "宁波东力", "红宝丽", "莱茵生物", "东方锆业", "惠程科技", "智光电气", "芭田股份", "楚江新材", "澳洋健康", "创新医疗", "游族网络", "*ST东网", "*ST江特", "御银股份", "延华智能", "中航光电", "纳思达", "粤传媒", "云海金属", "怡亚通", "海得控制", "华天科技", "全聚德", "广百股份", "ST巴士", "中光学", "成飞集成", "劲嘉股份", "*ST融捷", "如意集团", "武汉凡谷", "二三四五", "方正电机", "证通电子", "嘉应制药", "东晶电子", "ST云投", "九鼎新材", "金风科技", "海亮股份", "大连重工", "国统股份", "海利得", "准油股份", "合肥城建", "达意隆", "*ST飞马", "宏达新材", "南洋股份", "大为股份", "大立科技", "诺普信", "三全食品", "合力泰", "拓日新能", "*ST恒康", "东华能源", "福晶科技", "鱼跃医疗", "三力士", "濮耐股份", "江南化工", "奥特迅", "合兴包装", "鸿博股份", "科大讯飞", "奥维通信", "启明信息", "塔牌集团", "民和股份", "安妮股份", "大华股份", "恒邦股份", "天威视讯", "奥特佳", "威华股份", "歌尔股份", "九阳股份", "通产丽星", "滨江集团", "澳洋顺昌", "北化股份", "*ST聚力", "华东数控", "大洋电机", "联化科技", "步步高", "上海莱士", "川大智胜", "泰和新材", "*ST海陆", "*ST兆新", "利尔化学", "*ST升达", "*ST德奥", "拓维信息", "恩华药业", "大东南", "新华都", "西仪股份", "浙富控股", "陕天然气", "卫士通", "美邦服饰", "华明装备", "东方雨虹", "川润股份", "水晶光电", "华昌化工", "桂林三金", "万马股份", "友阿股份", "神开股份", "久其软件", "*ST联络", "光迅科技", "博深股份", "天润工业", "亚太股份", "世联行", "保龄宝", "奇正藏药", "超华科技", "ST宇顺", "ST中科创", "星期六", "奥飞娱乐", "罗莱生活", "信立泰", "精艺股份", "辉煌科技", "博云新材", "中电兴发", "圣农发展", "太阳电缆", "齐心集团", "西部建设", "美盈森", "洋河股份", "南国置业", "ST云网", "北新路桥", "威创股份", "中利集团", "东方园林", "海大集团", "三泰控股", "日海智能", "南山控股", "焦点科技", "亚联发展", "众生药业", "久立特材", "*ST乐通", "海峡股份", "华英农业", "理工环科", "*ST雅博", "普利特", "洪涛股份", "永太科技", "富安娜", "新朋股份", "皇氏集团", "得利斯", "皖通科技", "仙琚制药", "ST罗普", "英威腾", "科华恒盛", "ST人乐", "赛象科技", "奥普光电", "积成电子", "格林美", "新纶科技", "巨力索具", "慈文传媒", "海宁皮城", "潮宏基", "柘中股份", "泰尔股份", "高乐股份", "精华制药", "北京科锐", "漫步者", "顺丰控股", "杰瑞股份", "*ST天娱", "兴民智通", "*ST赫美", "富临运业", "森源电气", "*ST北讯", "同德化工", "神剑股份", "汉王科技", "隆基机械", "中恒电气", "永安药业", "台海核电", "康力电梯", "太极股份", "卓翼科技", "亚太药业", "北方华创", "伟星新材", "千方科技", "丽鹏股份", "亚厦股份", "新北洋", "国创高新", "章源钨业", "宏创控股", "科远智慧", "双箭股份", "蓝帆医疗", "合众思壮", "东山精密", "大北农", "天原集团", "维信诺", "新亚制程", "航天彩虹", "信邦制药", "长青股份", "北京利尔", "力生制药", "联发股份", "双象股份", "星网锐捷", "梦洁股份", "垒知集团", "海普瑞", "省广集团", "中远海科", "和而泰", "爱仕达", "嘉欣丝绸", "四维图新", "远东传动", "多氟多", "齐翔腾达", "雅克科技", "广联达", "延安必康", "汉森制药", "雷科防务", "高德红外", "海康威视", "爱施德", "深南股份", "*ST康盛", "天虹股份", "ST毅昌", "达实智能", "科伦药业", "中粮资本", "贵州百灵", "凯撒文化", "*ST胜利", "ST尤夫", "云南锗业", "兆驰股份", "杭氧股份", "棕榈股份", "九安医疗", "太安堂", "万里扬", "长江健康", "兴森科技", "誉衡药业", "江苏神通", "启明星辰", "闰土股份", "众业达", "龙星化工", "金洲管道", "巨星科技", "*ST中南", "盛路通信", "*ST晨鑫", "中原内配", "国星光电", "*ST康得", "摩恩电气", "长高集团", "华软科技", "松芝股份", "百川股份", "欧菲光", "青龙管业", "益生股份", "晶澳科技", "赣锋锂业", "珠江啤酒", "嘉事堂", "沪电股份", "众应互联", "海格通信", "天齐锂业", "二六三", "申通快递", "三维工程", "*ST金正", "中超控股", "双环传动", "ST圣莱", "榕基软件", "立讯精密", "宝莫股份", "常宝股份", "富春环保", "新筑股份", "双塔食品", "广田集团", "润邦股份", "江海股份", "希努尔", "嘉麟杰", "大金重工", "金固股份", "浙江永强", "山东墨龙", "通鼎互联", "恒基达鑫", "荣盛石化", "华斯股份", "佳隆股份", "*ST辉丰", "雅化集团", "汉缆股份", "*ST科林", "山西证券", "*ST利源", "*ST鼎龙", "搜于特", "弘高创意", "大康农业", "协鑫集成", "涪陵榨菜", "老板电器", "天汽模", "中顺洁柔", "达华智能", "*ST蓝丰", "宝馨科技", "金字火腿", "旷达科技", "恺英网络", "科士达", "银河电子", "日发精机", "齐峰新材", "浙江众成", "天桥起重", "光正集团", "山东矿机", "新时达", "英飞拓", "*ST海源", "金财互联", "天顺风能", "新界泵业", "金杯电工", "杭锅股份", "*ST林重", "飞龙股份", "海联金汇", "司尔特", "云图控股", "亚太科技", "鸿路钢构", "中化岩土", "万和电气", "杰赛科技", "东方铁塔", "新联电子", "春兴精工", "金新农", "凯美特气", "千红制药", "尚荣医疗", "宝鼎科技", "南方轴承", "惠博普", "三七互娱", "辉隆股份", "洽洽食品", "巨人网络", "亚威股份", "通达股份", "徐家汇", "兄弟科技", "森马服饰", "天沃科技", "顺灏股份", "益盛药业", "唐人神", "百润股份", "ST步森", "贝因美", "德力股份", "索菲亚", "清新环境", "明牌珠宝", "*ST群兴", "通达动力", "雷柏科技", "闽发铝业", "中京电子", "圣阳股份", "未名医药", "好想你", "海能达", "西陇科学", "双星新材", "*ST围海", "奥拓电子", "史丹利", "瑞康医药", "万安科技", "恒大高新", "ST八菱", "日上集团", "比亚迪", "豪迈科技", "海南瑞泽", "金禾实业", "山东章鼓", "盛通股份", "领益智造", "龙蟒佰利", "世纪华通", "以岭药业", "姚记科技", "大连电瓷", "中公教育", "江苏国信", "捷顺科技", "爱康科技", "东方精工", "朗姿股份", "北玻股份", "奥佳华", "哈尔斯", "长青集团", "露笑科技", "丹邦科技", "艾格拉斯", "瑞和股份", "美吉姆", "融钰集团", "亚玛顿", "完美世界", "光启技术", "金达威", "宜昌交运", "成都路桥", "*ST仁智", "华西能源", "德尔未来", "道明光学", "申科股份", "棒杰股份", "安洁科技", "金安国纪", "赞宇科技", "*ST勤上", "雪人股份", "跨境通", "永高股份", "荣联科技", "万润股份", "佛慈制药", "华宏科技", "青青稞酒", "仁东控股", "卫星石化", "博彦科技", "ST加加", "利君股份", "扬子新材", "海思科", "万润科技", "共达电声", "ST摩登", "中科金财", "雪迪龙", "凯文教育", "茂硕电源", "克明面业", "京威股份", "普邦股份", "长鹰信质", "首航高科", "德联集团", "鞍重股份", "奥马电器", "康达新材", "国盛金控", "龙泉股份", "东江环保", "西部证券", "兴业科技", "东诚药业", "顺威股份", "浙江美大", "珠江钢琴", "福建金森", "*ST奋达", "龙洲股份", "宏大爆破", "*ST猛狮", "华东重机", "亿利达", "乔治白", "金河生物", "远大智能", "美亚光电", "冀凯股份", "ST远程", "双成药业", "顾地科技", "煌上煌", "百洋股份", "红旗连锁", "博实股份", "美盛文化", "ST浩源", "奥瑞金", "海欣食品", "浙江世宝", "新宝股份", "良信电器", "众信旅游", "光洋股份", "天赐材料", "*ST欧浦", "思美传媒", "东易日盛", "牧原股份", "登云股份", "*ST金贵", "岭南股份", "友邦吊顶", "*ST麦趣", "金一文化", "金轮股份", "金莱特", "海洋王", "跃岭股份", "龙大肉食", "一心堂", "特一药业", "好利来", "电光科技", "萃华珠宝", "燕塘乳业", "雄韬股份", "利民股份", "王子新材", "国信证券", "葵花药业", "中矿资源", "万达电影", "爱迪尔", "光华科技", "三圣股份", "富煌钢构", "木林森", "仙坛股份", "埃斯顿", "世龙实业", "国光股份", "龙津药业", "易尚展示", "昇兴股份", "永东股份", "奥赛康", "永兴材料", "南兴股份", "华通医药", "天际股份", "凤形股份", "多喜爱", "金发拉比", "汇洁股份", "蓝黛传动", "*ST索菱", "先锋电子", "国恩股份", "普路通", "ST科迪", "真视通", "众兴菌业", "康弘药业", "快意电梯", "文科园林", "柏堡龙", "久远银海", "高科石化", "中坚科技", "三夫户外", "奇信股份", "可立克", "凯龙股份", "万里石", "银宝山新", "华源控股", "鹭燕医药", "建艺集团", "瑞尔特", "坚朗五金", "通宇通讯", "罗欣药业", "永和智控", "世嘉科技", "第一创业", "帝欧家居", "环球印务", "天顺股份", "微光股份", "洪汇新材", "吉宏股份", "丰元股份", "华锋股份", "江阴银行", "恒久科技", "红墙股份", "山东赫达", "郑中设计", "恩捷股份", "路畅科技", "崇达技术", "和科达", "黄山胶囊", "富森美", "东方中科", "桂发祥", "凯莱英", "中装建设", "凯中精密", "和胜股份", "纳尔股份", "易明医药", "高争民爆", "贝肯能源", "星网宇达", "名雕股份", "裕同科技", "比音勒芬", "弘亚数控", "同为股份", "新宏泽", "英维克", "道恩股份", "张家港行", "华统股份", "视源股份", "翔鹭钨业", "泰嘉股份", "同兴达", "英联股份", "盐津铺子", "高斯贝尔", "威星智能", "科达利", "麦格米特", "道道全", "皮阿诺", "捷荣技术", "美芝股份", "三晖电气", "力盛赛车", "洁美科技", "星帅尔", "瀛通通讯", "实丰文化", "今飞凯达", "盘龙药业", "钧达股份", "传艺科技", "周大生", "绿康生化", "金溢科技", "香山股份", "伟隆股份", "ST天圣", "新天药业", "安奈儿", "三利谱", "智能自控", "元隆雅图", "长缆科技", "卫光生物", "美格智能", "金龙羽", "中设股份", "凌霄泵业", "京泉华", "沃特股份", "绿茵生态", "惠威科技", "东方嘉盛", "弘宇股份", "中宠股份", "科力尔", "华通热力", "川恒股份", "中大力德", "意华股份", "赛隆药业", "英派斯", "哈三联", "大博医疗", "铭普光磁", "宇环数控", "金逸影视", "华阳集团", "华森制药", "德生科技", "集泰股份", "庄园牧场", "佛燃能源", "中新赛克", "奥士康", "中欣氟材", "深南电路", "金奥博", "蒙娜丽莎", "名臣健康", "德赛西威", "联诚精密", "伊戈尔", "润都股份", "盈趣科技", "华西证券", "泰永长征", "华夏航空", "润建股份", "宏川智慧", "锋龙股份", "明德生物", "新兴装备", "天奥电子", "郑州银行", "兴瑞科技", "鹏鼎控股", "长城证券", "昂利康", "新疆交建", "新农股份", "宇晶股份", "华林证券", "新乳业", "恒铭达", "青岛银行", "华阳国际", "奥美医疗", "金时科技", "亚世光电", "日丰股份", "鸿合科技", "西麦食品", "科瑞技术", "青农商行", "小熊电器", "青鸟消防", "瑞达期货", "五方光电", "豪尔赛", "祥鑫科技", "苏州银行", "广电计量", "新大正", "嘉美包装", "锐明技术", "和远气体", "科安达", "侨银环保", "博杰股份", "瑞玛工业", "天箭科技", "安宁股份", "雷赛智能", "华盛昌", "朝阳科技", "湘佳股份", "芯瑞达", "北摩高科", "宇新股份", "京北方", "豪美新材", "中天精装", "盛视科技", "甘源食品", "宝明科技", "奥海科技", "天地在线", "中国广核", "特锐德", "神州泰岳", "乐普医疗", "南风股份", "探路者", "莱美药业", "汉威科技", "天海防务", "安科生物", "豆神教育", "鼎汉技术", "华测检测", "新宁物流", "亿纬锂能", "爱尔眼科", "北陆药业", "网宿科技", "中元股份", "硅宝科技", "银江股份", "大禹节水", "吉峰科技", "宝德股份", "机器人", "华星创业", "红日药业", "华谊兄弟", "天龙光电", "阳普医疗", "宝通科技", "金龙机电", "同花顺", "钢研高纳", "中科电气", "超图软件", "新宙邦", "数知科技", "上海凯宝", "九洲集团", "回天新材", "朗科科技", "星辉娱乐", "赛为智能", "华力创通", "台基股份", "天源迪科", "合康新能", "福瑞股份", "世纪鼎利", "三五互联", "中青宝", "欧比特", "鼎龙股份", "万邦达", "中创环保", "万顺新材", "蓝色光标", "东方财富", "旗天科技", "中能电气", "天龙集团", "豫金刚石", "海兰信", "三川智慧", "安诺其", "南都电源", "金利华电", "碧水源", "华谊嘉信", "三聚环保", "当升科技", "华平股份", "数字政通", "GQY视讯", "国民技术", "思创医惠", "数码科技", "易成新能", "恒信东方", "奥克股份", "创世纪", "海默科技", "银之杰", "康芝药业", "荃银高科", "长信科技", "文化长城", "金通灵", "科新机电", "金刚玻璃", "国联水产", "华伍股份", "易联众", "智云股份", "高新兴", "精准信息", "双林股份", "振芯科技", "乾照光电", "达刚控股", "龙源技术", "西部牧业", "建新股份", "吉药控股", "新开源", "华仁药业", "向日葵", "万讯自控", "顺网科技", "中航电测", "长盈精密", "坚瑞沃能", "嘉寓股份", "东方日升", "瑞普生物", "经纬辉开", "阳谷华泰", "智飞生物", "亚光科技", "汇川技术", "聆达股份", "锐奇股份", "银河磁体", "锦富技术", "泰胜风能", "新国都", "英唐智控", "青松股份", "华策影视", "大富科技", "宝利国际", "信维通信", "先河环保", "晨光生物", "晓程科技", "中环装备", "和顺电气", "沃森生物", "盈康生命", "宋城演艺", "中金环境", "汤臣倍健", "香雪制药", "天舟文化", "量子生物", "世纪瑞尔", "昌红科技", "科融环境", "科泰电源", "瑞凌股份", "安居宝", "恒泰艾普", "振东制药", "新研股份", "秀强股份", "华中数控", "雷曼光电", "先锋新材", "通源石油", "天瑞仪器", "东方国信", "迪威迅", "万达信息", "天晟新材", "汉得信息", "东富龙", "中电环保", "福能东方", "元力股份", "朗源股份", "派生科技", "中海达", "腾邦国际", "四方达", "华峰超纤", "佐力药业", "捷成股份", "东软载波", "力源信息", "通裕重工", "永清环保", "美亚柏科", "神农科技", "维尔利", "潜能恒信", "科斯伍德", "佳士科技", "福安药业", "长荣股份", "长海股份", "铁汉生态", "纳川股份", "翰宇药业", "高盟新材", "海伦哲", "聚龙股份", "聚光科技", "舒泰神", "天喻信息", "理邦仪器", "欣旺达", "青岛中程", "天泽信息", "森远股份", "亿通科技", "易华录", "佳讯飞鸿", "日科化学", "电科院", "千山退", "东方电热", "安利股份", "鸿利智汇", "金运激光", "银禧科技", "科大智能", "北京君正", "正海磁材", "金力泰", "上海钢联", "光韵达", "富瑞特装", "拓尔思", "永利股份", "银信科技", "洲明科技", "金城医药", "开尔新材", "方直科技", "上海新阳", "美晨生态", "冠昊生物", "东宝生物", "飞力达", "瑞丰光电", "佳云科技", "瑞丰高材", "迪安诊断", "天玑科技", "宝莱特", "融捷健康", "新开普", "依米康", "初灵信息", "光线传媒", "金信诺", "卫宁健康", "仟源医药", "常山药业", "星星科技", "开山股份", "精锻科技", "新天科技", "新莱应材", "雅本化学", "巴安水务", "隆华科技", "佳创视讯", "通光线缆", "兴源环境", "尔康制药", "佳沃股份", "联建光电", "中威电子", "华宇软件", "开能健康", "和佳医疗", "阳光电源", "梅安森", "三丰智能", "海联讯", "华昌达", "和晶科技", "紫天科技", "金明精机", "三盛教育", "温州宏丰", "苏交科", "国瓷材料", "安科瑞", "飞利信", "朗玛信息", "利德曼", "荣科科技", "华录百纳", "吴通控股", "蓝英装备", "博雅生物", "三六五网", "利亚德", "蓝盾股份", "三诺生物", "富春股份", "汉鼎宇佑", "长方集团", "同有科技", "聚飞光电", "云意电气", "裕兴股份", "远方信息", "慈星股份", "中际旭创", "吉艾科技", "宜通世纪", "任子行", "邦讯技术", "天山生物", "戴维医疗", "掌趣科技", "晶盛机电", "珈伟新能", "博晖创新", "麦捷科技", "海达股份", "同大股份", "硕贝德", "华灿光电", "旋极信息", "德威新材", "凯利泰", "中颖电子", "宜安科技", "海伦钢琴", "华虹计通", "苏大维格", "天壕环境", "兆日科技", "津膜科技", "迪森股份", "新文化", "银邦股份", "开元股份", "润和软件", "科恒股份", "麦克奥迪", "天银机电", "联创股份", "太空智造", "华民股份", "南大光电", "泰格医药", "长亮科技", "金卡智能", "华鹏飞", "永贵电器", "北信源", "东土科技", "东华测试", "蒙草生态", "光一科技", "我武生物", "楚天科技", "全通教育", "炬华科技", "天翔环境", "博腾股份", "中文在线", "恒华科技", "创意信息", "东方网力", "汇金股份", "绿盟科技", "安控科技", "汇中股份", "扬杰科技", "中铁装配", "鹏翎股份", "易事特", "赢时胜", "鼎捷软件", "东方通", "安硕信息", "溢多利", "斯莱克", "光环新网", "三联虹普", "雪浪环境", "飞天诚信", "富邦股份", "国祯环保", "艾比森", "天华超净", "康跃科技", "腾信股份", "中来股份", "天孚通信", "菲利华", "迪瑞医疗", "天和防务", "飞凯材料", "京天利", "劲拓股份", "花园生物", "宝色股份", "汉宇集团", "博济医药", "科隆股份", "九强生物", "凯发电气", "三环集团", "道氏技术", "正业科技", "金盾股份", "迦南科技", "芒果超媒", "中光防雷", "伊之密", "苏试试验", "南华仪器", "昆仑万维", "浩丰科技", "五洋停车", "力星股份", "博世科", "鲁亿通", "航新科技", "中建环能", "唐德影视", "红相股份", "四通新材", "强力新材", "诚益通", "暴风集团", "富临精工", "蓝思科技", "金石亚药", "中泰股份", "广生堂", "清水源", "鹏辉能源", "美康生物", "运达科技", "鲍斯股份", "普丽盛", "金雷股份", "双杰电气", "康斯特", "乐凯新材", "全信股份", "浩云科技", "汉邦高科", "先导智能", "创业慧康", "山河药辅", "三鑫医疗", "深信服", "康拓红外", "赛微电子", "赢合科技", "全志科技", "金科文化", "惠伦晶体", "田中精机", "华铭智能", "迈克生物", "星徽精密", "高伟达", "赛摩智能", "迅游科技", "四方精创", "信息发展", "中密控股", "厚普股份", "新元科技", "德尔股份", "景嘉微", "聚隆科技", "胜宏科技", "合纵科技", "杭州高新", "神思电子", "光力科技", "濮阳惠成", "万孚生物", "沃施股份", "蓝海华腾", "赛升药业", "东杰智能", "蓝晓科技", "恒锋工具", "中飞股份", "华自科技", "通合科技", "华图山鼎", "润欣科技", "盛天网络", "美尚生态", "中科创达", "富祥药业", "温氏股份", "高澜股份", "启迪设计", "海顺新材", "新易盛", "昊志机电", "天邑股份", "川金诺", "名家汇", "苏奥传感", "维宏股份", "新美星", "金冠股份", "雪榕生物", "中亚股份", "恒实科技", "友讯达", "三德科技", "久之洋", "海波重科", "盛讯达", "新光药业", "科大国创", "爱司凯", "世名科技", "辰安科技", "博思软件", "中潜股份", "中船应急", "幸福蓝海", "健帆生物", "达志科技", "优博讯", "今天国际", "冰川网络", "陇神戎发", "达威股份", "农尚环境", "广信材料", "同益股份", "横河模具", "深冷股份", "先进数通", "新晨科技", "朗科智能", "联得装备", "雄帝科技", "川环科技", "博创科技", "优德精密", "和仁科技", "古鳌科技", "万集科技", "集智股份", "三超新材", "路通视信", "丝路视觉", "理工光科", "贝达药业", "佳发教育", "中富通", "汇金科技", "乐心医疗", "神宇股份", "筑博设计", "科信技术", "激智科技", "精测电子", "星源材质", "天能重工", "太辰光", "平治信息", "安车检测", "兴齐眼药", "中旗股份", "容大感光", "开润股份", "会畅通讯", "数字认证", "贝斯特", "晨曦航空", "英飞特", "赛托生物", "海辰药业", "奥联电子", "美联新材", "天铁股份", "熙菱信息", "江龙船艇", "移为通信", "万里马", "华凯创意", "新雷能", "朗进科技", "欧普康视", "利安隆", "吉大通信", "诚迈科技", "雄塑科技", "瑞特股份", "康泰生物", "飞荣达", "立昂技术", "长川科技", "恒锋信息", "金太阳", "拓斯达", "思特奇", "汇纳科技", "晨化股份", "美力科技", "宣亚国际", "富瀚微", "欣天科技", "尚品宅配", "安靠智电", "寒锐钴业", "金银河", "光库科技", "维业股份", "博士眼镜", "捷捷微电", "万兴科技", "三雄极光", "华瑞股份", "华测导航", "亿联网络", "新劲刚", "普利制药", "久吾高科", "光莆股份", "开立医疗", "彩讯股份", "中达安", "同和药业", "扬帆新材", "广和通", "凯普生物", "德艺文创", "正丹股份", "透景生命", "万通智控", "南京聚隆", "正元智慧", "超频三", "星云股份", "杭州园林", "太龙照明", "金陵体育", "雷迪克", "正海生物", "世纪天鸿", "晶瑞股份", "民德电子", "弘信电子", "延江股份", "中孚信息", "江苏雷利", "圣邦股份", "科锐国际", "科蓝软件", "鹏鹞环保", "飞鹿股份", "江丰电子", "必创科技", "杰恩设计", "沪宁股份", "大烨智能", "富满电子", "国科微", "佩蒂股份", "宇信科技", "建科院", "华大基因", "英科医疗", "中科信息", "电连技术", "隆盛科技", "英搏尔", "朗新科技", "海特生物", "中石科技", "艾德生物", "智动力", "赛意信息", "创业黑马", "澄天伟业", "双一科技", "联合光电", "中环环保", "盛弘股份", "蠡湖股份", "兆丰股份", "爱乐达", "电工合金", "万马科技", "光威复材", "岱勒新材", "森霸传感", "天宇股份", "创源文化", "九典制药", "阿石创", "威唐工业", "聚灿光电", "精研科技", "万隆光电", "广哈通信", "永福股份", "英可瑞", "凯伦股份", "国立科技", "华信新材", "长盛轴承", "安达维尔", "海川智能", "怡达股份", "新余国科", "一品红", "捷佳伟创", "药石科技", "宏达电子", "润禾材料", "乐歌股份", "科创信息", "科创新源", "设研院", "西菱动力", "光弘科技", "百邦科技", "科顺股份", "奥飞数据", "明阳电路", "御家汇", "华宝股份", "越博动力", "天地数码", "欣锐科技", "汉嘉设计", "锐科激光", "金力永磁", "顶固集创", "宁德时代", "迈为股份", "隆利科技", "爱朋医疗", "华致酒行", "中山金马", "罗博特科", "七彩化学", "康龙化成", "迈瑞医疗", "立华股份", "上海瀚讯", "锦浪科技", "新诺威", "每日互动", "震安科技", "迪普科技", "德方纳米", "新媒股份", "智莱科技", "运达股份", "拉卡拉", "三角防务", "帝尔激光", "中简科技", "新城市", "惠城环保", "德恩精工", "因赛集团", "卓胜微", "三只松鼠", "值得买", "国林科技", "海能实业", "中信出版", "唐源电气", "宇瞳光学", "仙乐健康", "壹网壹创", "佳禾智能", "米奥会展", "贝斯美", "钢研纳克", "锦鸡股份", "左江科技", "力合科技", "泰和科技", "矩子科技", "指南针", "电声股份", "斯迪克", "天迈科技", "久量股份", "华辰装备", "中科海讯", "铂科新材", "易天股份", "泰林生物", "玉禾田", "艾可蓝", "双飞股份", "耐普矿机", "聚杰微纤", "英杰电气", "东岳硅材", "贝仕达克", "建科机械", "北鼎股份", "阿尔特", "测绘股份", "上能电气", "锐新科技", "金丹科技", "金现代", "派瑞股份", "新产业", "浩洋股份", "龙磁科技", "佰奥智能", "浙矿股份", "浙江力诺", "博汇股份", "酷特智能", "康华生物", "帝科股份", "胜蓝股份", "捷安高科", "首都在线", "中船汉光", "美瑞新材", "锦盛新材", "新强联", "交大思诺", "四会富仕", "申昊科技", "图南股份", "科思股份", "协创数据", "科拓生物", "西域旅游", "锋尚文化", "美畅股份", "蓝盾光电", "卡倍亿", "南大环境", "大宏立", "安克创新", "圣元环保", "杰美特", "康泰医学", "欧陆通", "回盛生物", "天阳科技", "海晨股份", "捷强装备", "蒙泰高新", "金春股份", "维康药业", "浦发银行", "白云机场", "东风汽车", "中国国贸", "首创股份", "上海机场", "包钢股份", "华能国际", "皖通高速", "华夏银行", "民生银行", "日照港", "上港集团", "宝钢股份", "中原高速", "上海电力", "山东钢铁", "浙能电力", "华能水电", "中远海能", "华电国际", "中国石化", "南方航空", "中信证券", "三一重工", "福建高速", "楚天高速", "招商银行", "歌华有线", "中直股份", "四川路桥", "保利地产", "中国联通", "宁波联合", "浙江广厦", "九鼎投资", "黄山旅游", "万东医疗", "中国医药", "厦门象屿", "五矿发展", "古越龙山", "海信视像", "国投资本", "华润双鹤", "皖维高新", "南京高科", "宇通客车", "冠城大通", "葛洲坝", "退市银鸽", "浙江富润", "凤凰光学", "中船科技", "上海梅林", "新疆天业", "康欣新材", "宋都股份", "澄星股份", "人福医药", "ST金花", "东风科技", "海泰发展", "*ST博信", "ST中葡", "同仁堂", "*ST金钰", "中视传媒", "特变电工", "*ST济堂", "ST明科", "易见股份", "大名城", "哈高科", "云天化", "开创国际", "广州发展", "林海股份", "同方股份", "明星电力", "青山纸业", "上汽集团", "永鼎股份", "重庆路桥", "美尔雅", "亚盛集团", "国金证券", "诺德股份", "北方稀土", "ST天成", "浙江东日", "东睦股份", "东方航空", "三峡水利", "西宁特钢", "中国卫星", "ST长投", "浙江东方", "郑州煤电", "*ST宏图", "兰花科创", "铁龙物流", "杭钢股份", "金健米业", "弘业股份", "太极集团", "波导股份", "国网信通", "重庆啤酒", "东湖高新", "乐凯胶片", "当代文体", "浪莎股份", "中青旅", "西部资源", "兴发集团", "金发科技", "*ST新亿", "*ST环球", "长春一东", "ST坊展", "中国船舶", "航天机电", "维科技术", "建发股份", "华创阳安", "华升股份", "永泰能源", "中体产业", "大龙地产", "巨化股份", "天坛生物", "香江控股", "中闽能源", "新日恒力", "福田汽车", "联美控股", "武汉控股", "太原重工", "上海建工", "上海贝岭", "黄河旋风", "卧龙地产", "中国巨石", "雅戈尔", "东安动力", "*ST安通", "瑞茂通", "S佳通", "生益科技", "光电股份", "格力地产", "莲花健康", "国中水务", "兖州煤业", "吉林森工", "锦州港", "华资实业", "长城电工", "ST创兴", "中牧股份", "复星医药", "伊力特", "大唐电信", "金种子酒", "江苏吴中", "生物股份", "哈空调", "福日电子", "有研新材", "安彩高科", "新湖中宝", "ST罗顿", "紫江企业", "西藏药业", "*ST江泉", "亚星客车", "*ST经开", "浙江医药", "中再资环", "全柴动力", "南山铝业", "江苏阳光", "海航控股", "太龙药业", "鲁商发展", "*ST松江", "*ST瀚叶", "圣济堂", "ST昌九", "城市传媒", "沧州大化", "凌钢股份", "金鹰股份", "圆通速递", "ST山水", "民丰特纸", "桂冠电力", "铜峰电子", "ST椰岛", "云南城投", "*ST时万", "*ST中昌", "*ST海华", "万通发展", "*ST成城", "延长化建", "两面针", "南纺股份", "冠农股份", "中恒集团", "*ST梦舟", "广汇能源", "大湖股份", "首旅酒店", "广晟有色", "凯乐科技", "阳光照明", "北方股份", "ST景谷", "城建发展", "海正药业", "国电南自", "赣粤高速", "航天信息", "开开实业", "嘉化能源", "ST昌鱼", "恒瑞医药", "亿利洁能", "东方创业", "重庆港九", "*ST中商", "太化股份", "南钢股份", "钱江水利", "浦东建设", "羚锐制药", "江苏舜天", "大恒科技", "*ST信通", "*ST华仪", "西水股份", "远达环保", "三峡新材", "鄂尔多斯", "广汇汽车", "安琪酵母", "安迪苏", "维维股份", "ST南化", "标准股份", "曙光股份", "恒顺醋业", "*ST商城", "酒钢宏兴", "华泰股份", "万华化学", "桂东电力", "*ST荣华", "平高电气", "农发种业", "上海家化", "洪都航空", "营口港", "新力金融", "ST亚星", "振华重工", "正源股份", "天房发展", "瀚蓝环境", "华发股份", "西藏天路", "大东方", "中盐化工", "中新药业", "天通股份", "宏达股份", "白云山", "长春燃气", "国机汽车", "澳柯玛", "美克家居", "西藏珠峰", "中油工程", "华夏幸福", "航天动力", "长江通信", "恒力石化", "阳泉煤业", "山东高速", "亚宝药业", "浙江龙盛", "旭光电子", "*ST敦种", "精伦电子", "恒丰纸业", "*ST联合", "新农开发", "华微电子", "华联综超", "江西铜业", "联创光电", "ST通葡", "宁波韵升", "红星发展", "五洲交通", "西南证券", "三房巷", "万向德农", "中航电子", "中文传媒", "华菱星马", "首开股份", "宁沪高速", "昊华科技", "宝光股份", "健康元", "青海春天", "广东明珠", "金地集团", "ST金泰", "北巴传媒", "海越能源", "龙净环保", "江山股份", "五矿资本", "航发科技", "盛和资源", "粤泰股份", "盘江股份", "金山股份", "安源煤业", "海澜之家", "ST抚钢", "红豆股份", "大有能源", "动力源", "国电南瑞", "ST安泰", "三友化工", "华胜天成", "小商品城", "*ST湘电", "江淮汽车", "天润乳业", "现代制药", "ST仰帆", "昆药集团", "ST柳化", "青松建化", "华鲁恒升", "中远海特", "三元股份", "冠豪高新", "北方导航", "片仔癀", "通威股份", "瑞贝卡", "国机通用", "金证股份", "华纺股份", "宁夏建材", "涪陵电力", "博通股份", "宝钛股份", "时代新材", "贵研铂业", "士兰微", "洪城水业", "*ST九有", "空港股份", "蓝光发展", "好当家", "百利电气", "风神股份", "*ST六化", "华光环能", "湘邮科技", "杭萧钢构", "科力远", "千金药业", "凌云股份", "双良节能", "中国动力", "福能股份", "*ST信威", "扬农化工", "亨通光电", "天药股份", "中金黄金", "鹏欣资源", "龙元建设", "凤竹纺织", "晋西车轴", "精工钢构", "驰宏锌锗", "烽火通信", "科达制造", "中化国际", "航天晨光", "安徽建工", "华丽家族", "西昌电力", "香梨股份", "方大特钢", "上海能源", "天富能源", "黑牡丹", "国药股份", "腾达建设", "联环药业", "海航基础", "方大炭素", "国网英大", "ST康美", "贵州茅台", "文一科技", "华海药业", "中天科技", "贵航股份", "长园集团", "菲达环保", "江南高纤", "中铁工业", "山东药玻", "*ST交昂", "豫光金铅", "宏达矿业", "栖霞建设", "天士力", "中国软件", "亿晶光电", "国发股份", "ST狮头", "新赛股份", "莫高股份", "卓郎智能", "山煤国际", "山东黄金", "深高速", "厦门钨业", "保变电气", "时代出版", "凯盛科技", "*ST海创", "天下秀", "康缘药业", "大西洋", "老白干酒", "金自天正", "江西长运", "国睿科技", "法拉电子", "迪马股份", "济川药业", "山鹰纸业", "*ST中珠", "安阳钢铁", "恒生电子", "信雅达", "康恩贝", "惠泉啤酒", "淮河能源", "祥源文化", "精达股份", "京能电力", "克劳斯", "卧龙电驱", "八一钢铁", "天地科技", "海油工程", "长电科技", "海螺水泥", "金晶科技", "新华医疗", "用友网络", "广东榕泰", "泰豪科技", "龙溪股份", "大连圣亚", "益佰制药", "ST中孚", "新安股份", "光明乳业", "北大荒", "*ST熊猫", "青岛啤酒", "方正科技", "云赛智联", "广汇物流", "市北高新", "汇通能源", "绿地控股", "ST沪科", "金杯汽车", "ST毅达", "大众交通", "老凤祥", "神奇制药", "*ST鹏起", "丰华股份", "金枫酒业", "国新能源", "氯碱化工", "海立股份", "天宸股份", "华鑫股份", "光大嘉宝", "华谊集团", "复旦复华", "申达股份", "新世界", "华建集团", "龙头股份", "浙数文化", "*ST富控", "大众公用", "国新文化", "东方明珠", "新黄浦", "浦东金桥", "号百控股", "万业企业", "申能股份", "爱建集团", "乐山电力", "中源协和", "同达创业", "外高桥", "城投控股", "锦江投资", "*ST飞乐", "ST游久", "申华控股", "ST中安", "豫园股份", "信达地产", "电子城", "福耀玻璃", "昂立教育", "强生控股", "陆家嘴", "哈药股份", "天地源", "ST瑞德", "太极实业", "尖峰集团", "*ST目药", "东阳光", "川投能源", "中华企业", "交运股份", "*ST航通", "四川金顶", "上海凤凰", "百川能源", "南京新百", "京投发展", "珠江实业", "中船防务", "金龙汽车", "*ST刚泰", "上海石化", "上海三毛", "海尔智家", "阳煤化工", "亚通股份", "东百集团", "大商股份", "绿庭投资", "ST岩石", "欧亚集团", "ST天雁", "均胜电子", "*ST工新", "舍得酒业", "三安光电", "物产中大", "中航资本", "曲江文旅", "彩虹股份", "光明地产", "苏美达", "盛屯矿业", "南宁百货", "南京医药", "金瑞矿业", "文投控股", "凤凰股份", "天津港", "东软集团", "大连热电", "祁连山", "ST百花", "金牛化工", "首商股份", "宁波富达", "ST云维", "华电能源", "鲁北化工", "佳都科技", "重庆百货", "中国高科", "湖南海利", "爱旭股份", "北汽蓝谷", "*ST实达", "新华锦", "苏州高新", "中粮糖业", "兰州民百", "辽宁成大", "山西焦化", "华域汽车", "一汽富维", "华远地产", "华银电力", "闻泰科技", "江苏索普", "上实发展", "西藏旅游", "江中药业", "海航科技", "东方银星", "锦江酒店", "厦门国贸", "浪潮软件", "长江传媒", "辽宁能源", "洲际油气", "中航沈飞", "安徽合力", "通策医疗", "中国海防", "中航重机", "园城黄金", "ST运盛", "宁波富邦", "祥龙电业", "综艺股份", "广誉远", "西藏城投", "汉商集团", "南京熊猫", "东方通信", "新潮能源", "友好集团", "水井坊", "通宝能源", "*ST辅仁", "新钢股份", "鲁信创投", "鲁银投资", "新华百货", "中储股份", "鲁抗医药", "轻纺城", "京能置业", "云煤能源", "宜宾纸业", "保税科技", "国电电力", "钱江生化", "浙大网新", "宁波海运", "天津磁卡", "华新水泥", "福建水泥", "新奥股份", "鹏博士", "悦达投资", "济南高新", "马钢股份", "山西汾酒", "神马股份", "东方集团", "华北制药", "杭州解百", "*ST厦工", "*ST安信", "ST宏盛", "中路股份", "耀皮玻璃", "隧道股份", "*ST劝业", "上海物贸", "世茂股份", "益民集团", "新华传媒", "兰生股份", "百联股份", "茂业商业", "人民同泰", "香溢融通", "广电网络", "第一医药", "申通地铁", "上海机电", "*ST界龙", "海通证券", "上海九百", "四川长虹", "上柴股份", "上工申贝", "丹化科技", "宝信软件", "同济科技", "万里股份", "上海临港", "华东电脑", "海欣股份", "龙建股份", "春兰股份", "航天长峰", "*ST中天", "宁波中百", "银座股份", "王府井", "*ST京城", "北京城乡", "中航高科", "内蒙华电", "哈投股份", "百大集团", "星湖科技", "通化东宝", "梅雁吉祥", "智慧能源", "ST厦华", "石化油服", "中炬高新", "梅花生物", "创业环保", "东方电气", "洛阳玻璃", "ST电能", "航天电子", "博瑞传播", "亚泰集团", "妙可蓝多", "博闻科技", "杉杉股份", "宏发股份", "国投电力", "伊利股份", "新疆众和", "南京化纤", "中房股份", "*ST秋林", "*ST大晟", "航发动力", "广日股份", "张江高科", "览海医疗", "厦门空港", "*ST美讯", "长江电力", "江苏租赁", "贵州燃气", "无锡银行", "华安证券", "重庆燃气", "中泰证券", "江苏银行", "杭州银行", "西安银行", "湖南盐业", "爱柯迪", "广西广电", "重庆建工", "新天绿能", "东方证券", "江苏有线", "渤海汽车", "株冶集团", "国投中鲁", "岳阳林纸", "福成股份", "博汇纸业", "内蒙一机", "海油发展", "郴电国际", "中材国际", "恒源煤电", "宝胜股份", "新五丰", "健民集团", "中国电影", "*ST宜生", "广安爱众", "北矿科技", "汇鸿集团", "宁波热电", "惠而浦", "建设机械", "淮北矿业", "科达股份", "航民股份", "赤峰黄金", "宝丰能源", "四创电子", "贵绳股份", "马应龙", "文山电力", "贵广网络", "开滦股份", "九州通", "招商证券", "唐山港", "大同煤业", "晋亿实业", "柳钢股份", "重庆钢铁", "大秦铁路", "金陵饭店", "连云港", "南京银行", "文峰股份", "宝泰隆", "隆基股份", "陕西黑猫", "节能风电", "宁波港", "山东出版", "华钰矿业", "春秋航空", "玉龙股份", "一拖股份", "赛轮轮胎", "中信建投", "中铝国际", "西部黄金", "渝农商行", "国芳集团", "中国神华", "中南传媒", "太平洋", "恒立液压", "昊华能源", "中国一重", "四川成渝", "财通证券", "中国国航", "ST华鼎", "三江购物", "中国化学", "海南橡胶", "四方股份", "小康股份", "常熟银行", "博威合金", "工业富联", "深圳燃气", "新城控股", "重庆水务", "天风证券", "三角轮胎", "兴业银行", "西部矿业", "北京银行", "杭齿前进", "中国西电", "中国铁建", "龙江交通", "东兴证券", "江南水务", "上海环境", "东材科技", "国泰君安", "白银有色", "君正集团", "吉鑫科技", "林洋能源", "陕西煤业", "华电重工", "广州港", "上海银行", "环旭电子", "桐昆股份", "红塔证券", "广汽集团", "ST庞大", "农业银行", "青岛港", "骆驼股份", "中国平安", "中国人保", "秦港股份", "交通银行", "绿色动力", "广深铁路", "新华保险", "百隆东方", "三六零", "利群股份", "绿城水务", "陕鼓动力", "中原证券", "兴业证券", "怡球资源", "中国中铁", "工商银行", "ST国重装", "国联证券", "通用股份", "中新集团", "东风股份", "吉林高速", "大智慧", "东吴证券", "九牧王", "三星医疗", "长沙银行", "会稽山", "北辰实业", "上海电影", "中国外运", "鹿港文化", "中国铝业", "中国太保", "长城军工", "上海医药", "中信重工", "金田铜业", "中国核建", "明阳智能", "广电电气", "中国中冶", "嘉泽新能", "中国人寿", "长城汽车", "旗滨集团", "邮储银行", "平煤股份", "中国建筑", "中国电建", "明泰铝业", "滨化股份", "华泰证券", "拓普集团", "中银证券", "中国卫通", "潞安环能", "风范股份", "郑煤机", "际华集团", "上海电气", "中国中车", "*ST力帆", "晶科科技", "光大证券", "宁波建工", "蓝科高新", "星宇股份", "中国交建", "皖新传媒", "中海油服", "新华文轩", "京沪高铁", "光大银行", "三峰环境", "美凯龙", "成都银行", "中国石油", "中国科传", "紫金银行", "福莱特", "中远海发", "长飞光纤", "招商轮船", "正泰电器", "浙商证券", "大连港", "中国银河", "海天精工", "江河集团", "中国中免", "亚星锚链", "中煤能源", "紫金矿业", "南方传媒", "方正证券", "京运通", "浙商银行", "新集能源", "中远海控", "凤凰传媒", "吉视传媒", "永辉超市", "建设银行", "中国出版", "苏垦农发", "金钼股份", "中国汽研", "玲珑轮胎", "宝钢包装", "海南矿业", "招商南油", "中国核电", "中国银行", "中国重工", "南京证券", "大唐发电", "金隅集团", "丰林集团", "贵阳银行", "中信银行", "出版传媒", "人民网", "奥康国际", "宏昌电子", "龙宇燃油", "晶方科技", "联明股份", "花王股份", "喜临门", "北特科技", "万盛股份", "合锻智能", "创力集团", "亚普股份", "弘讯科技", "新宏泰", "中衡设计", "中设集团", "中科曙光", "爱普股份", "山东华鹏", "新通联", "威帝股份", "大豪科技", "石大胜华", "千禾味业", "赛福天", "天鹅股份", "全筑股份", "安德利", "德新交运", "三维股份", "常熟汽饰", "如通股份", "凯众股份", "华立股份", "泛微网络", "新坐标", "美思德", "华脉科技", "广州酒家", "福达合金", "科林电气", "成都燃气", "台华新材", "德邦股份", "永吉股份", "倍加洁", "国检集团", "禾望电气", "音飞储存", "振华股份", "博通集成", "海汽集团", "乐惠国际", "和邦生物", "江化微", "圣达生物", "新疆火炬", "大丰实业", "剑桥科技", "天成自控", "先达股份", "甘李药业", "宁波精达", "正裕工业", "宏盛股份", "南华期货", "越剑智能", "新经典", "森特股份", "长白山", "川仪股份", "汇嘉时代", "横店影视", "芯能科技", "恒银科技", "润达医疗", "神驰机电", "东方材料", "康尼机电", "金能科技", "海星股份", "红蜻蜓", "万林物流", "共进股份", "华培动力", "翠微股份", "中材节能", "昭衍新药", "华贸物流", "春风动力", "上海沪工", "碳元科技", "天目湖", "海量数据", "康惠制药", "养元饮品", "*ST拉夏", "腾龙股份", "上海亚虹", "汇顶科技", "科华控股", "荣晟环保", "福达股份", "渤海轮渡", "莎普爱思", "兰石重装", "德创环保", "圣龙股份", "新泉股份", "金牌厨柜", "皇马科技", "建研院", "上机数控", "华正新材", "海容冷链", "ST亚邦", "网达软件", "汇得科技", "公牛集团", "日播时尚", "保隆科技", "迎驾贡酒", "九华旅游", "上海洗霸", "快克股份", "江山欧派", "赛伍技术", "爱婴室", "元利科技", "日月股份", "中贝通信", "爱丽家居", "济民制药", "恒通股份", "新凤鸣", "菲林格尔", "雪峰科技", "景旺电子", "奥翔药业", "格尔软件", "大参林", "移远通信", "诺邦股份", "浙江仙通", "宏和科技", "电魂网络", "药明康德", "合盛硅业", "天龙股份", "鸿远电子", "松发股份", "海鸥股份", "银都股份", "大业股份", "景津环保", "赛腾股份", "日盈电子", "海天味业", "泰瑞机器", "斯达半导", "永新光学", "杭叉集团", "苏盐井神", "华铁应急", "振德医疗", "得邦照明", "旭升股份", "华懋科技", "应流股份", "维力医疗", "金海环境", "梦百合", "福鞍股份", "诚邦股份", "天味食品", "派思股份", "湘油泵", "迪贝电气", "梅轮电梯", "超讯通信", "苏农银行", "我乐家居", "福蓉科技", "依顿电子", "上海雅仕", "上海天洋", "百达精工", "苏州龙杰", "尚纬股份", "迪生力", "宏辉果蔬", "杰克股份", "浙江鼎力", "四方科技", "安井食品", "文灿股份", "威尔药业", "和顺石油", "莱克电气", "华菱精工", "设计总院", "华达科技", "东珠生态", "百傲化学", "傲农生物", "水星家纺", "日出东方", "辰欣药业", "柳药股份", "今世缘", "东方时尚", "亚士创能", "三美股份", "易德龙", "顶点软件", "惠达卫浴", "广东骏亚", "基蛋生物", "元成股份", "*ST亚振", "通达电气", "万泰生物", "新天然气", "金辰股份", "邦宝益智", "吉翔股份", "建霖家居", "信捷电气", "鼎信通讯", "集友股份", "贵州三力", "吉比特", "九洲药业", "勘设股份", "风语筑", "振静股份", "科沃斯", "展鹏科技", "八方股份", "恒为科技", "翔港科技", "祥和实业", "韦尔股份", "金石资源", "南都物业", "振江股份", "思维列控", "欧普照明", "淳中科技", "绝味食品", "锦泓集团", "立霸股份", "司太立", "众源新材", "多伦科技", "神马电力", "掌阅科技", "嘉诚国际", "惠发食品", "美诺华", "奥普家居", "*ST贵人", "海兴电力", "起步股份", "健盛集团", "中通国脉", "普莱柯", "珍宝岛", "伟明环保", "长久物流", "汇金通", "三星新材", "荣泰健康", "艾艾精工", "捷昌驱动", "苏利股份", "金麒麟", "地素时尚", "高能环境", "口子窖", "康辰药业", "东尼电子", "伯特利", "引力传媒", "广信股份", "永艺股份", "再升科技", "纵横通信", "博天环境", "珀莱雅", "东方电缆", "京华激光", "天创时尚", "禾丰牧业", "麒盛科技", "诺力股份", "索通发展", "国联股份", "茶花股份", "韩建河山", "君禾股份", "杭电股份", "中曼石油", "科森科技", "清源股份", "利通电子", "拉芳家化", "徕木股份", "南威软件", "镇海股份", "艾迪精密", "海利尔", "畅联股份", "彤程新材", "朗博科技", "泰禾光电", "春光科技", "安图生物", "璞泰来", "苏州科达", "恒林股份", "柯力传感", "三祥新材", "康隆达", "亿嘉和", "五洲新春", "天马科技", "灵康药业", "卫信康", "奇精机械", "火炬电子", "华体科技", "今创集团", "永冠新材", "锦和商业", "晶华新材", "晨丰科技", "龙马环卫", "大胜达", "石英股份", "皖天然气", "至纯科技", "江苏新能", "安记食品", "有友食品", "航天工程", "纽威股份", "宁水集团", "德宏股份", "盛洋科技", "东方环宇", "健友股份", "家家悦", "中源家居", "香飘飘", "七一二", "密尔克卫", "塞力斯", "天域生态", "海利生物", "良品铺子", "中广天择", "阿科力", "天安新材", "朗迪集团", "博迈科", "鸣志电器", "龙韵股份", "岱美股份", "仙鹤股份", "三棵树", "泰晶科技", "蔚蓝生物", "日辰股份", "大元泵业", "秦安股份", "隆鑫通用", "中马传动", "常青股份", "沃格光电", "永安行", "来伊份", "乾景园林", "ST威龙", "科博达", "新日股份", "宁波高发", "星光农机", "雅运股份", "联泰环保", "康普顿", "华友钴业", "道森股份", "志邦家居", "瑞斯康达", "福斯特", "歌力思", "豪能股份", "丰山集团", "诚意药业", "原尚股份", "交建股份", "顾家家居", "海峡环保", "曲美家居", "神力股份", "嘉澳环保", "百合花", "华扬联众", "坤彩科技", "柯利达", "洛凯股份", "欧派家居", "四通股份", "安正时尚", "正平股份", "好太太", "华荣股份", "东宏股份", "步长制药", "能科股份", "中公高科", "白云电器", "松炀资源", "桃李面包", "新化股份", "飞科电器", "新智认知", "嘉友国际", "鼎胜新材", "太平鸟", "武进不锈", "永悦科技", "南卫股份", "数据港", "金域医学", "老百姓", "吉祥航空", "元祖股份", "城地股份", "新华网", "新澳股份", "春秋电子", "瑞芯微", "天永智能", "寿仙谷", "长城科技", "好莱客", "晨光文具", "莱绅通灵", "永创智能", "中持股份", "龙蟠科技", "牧高笛", "合诚股份", "佳力图", "国茂股份", "苏博特", "合力科技", "金桥信息", "金徽酒", "世运电路", "金鸿顺", "铁流股份", "中科软", "兴业股份", "亚翔集成", "格林达", "睿能科技", "博敏电子", "丽岛新材", "三孚股份", "益丰药房", "建业股份", "雪龙集团", "长源东谷", "大千生态", "威派格", "哈森股份", "百利科技", "克来机电", "大理药业", "法兰泰克", "中创物流", "醋化股份", "银龙股份", "中农立华", "正川股份", "国泰集团", "深圳新星", "金诚信", "吉华集团", "泉峰汽车", "丸美股份", "恒润股份", "兆易创新", "康德莱", "中电电机", "艾华集团", "麦迪科技", "至正股份", "松霖科技", "洛阳钼业", "甬金股份", "*ST中新", "继峰股份", "方盛制药", "读者传媒", "威奥股份", "长鸿高科", "天正电气", "冠盛股份", "华丰股份", "同庆楼", "力鼎光电", "派克新材", "华达新材", "聚合顺", "三人行", "时空科技", "国光连锁", "葫芦娃", "起帆电缆", "天普股份", "凯迪股份", "法狮龙", "沪光股份", "宏柏新材", "均瑶健康", "晨光新材", "华兴源创", "睿创微纳", "天准科技", "博汇科技", "容百科技", "杭可科技", "光峰科技", "澜起科技", "中国通号", "福光股份", "新光光电", "中微公司", "交控科技", "心脉医疗", "乐鑫科技", "安集科技", "方邦股份", "奥福环保", "瀚川智能", "安恒信息", "杰普特", "洁特生物", "国盾量子", "沃尔德", "南微医学", "山石网科", "天宜上佳", "传音控股", "芯源微", "当虹科技", "爱博医疗", "佳华科技", "龙腾光电", "宝兰德", "云涌科技", "凯赛生物", "航天宏图", "热景生物", "德林海", "大地熊", "龙软科技", "映翰通", "兴图新科", "三友医疗", "紫晶存储", "虹软科技", "嘉必优", "瑞松科技", "京源环保", "申联生物", "晶晨股份", "威胜信息", "三达膜", "金宏气体", "赛诺医疗", "金山办公", "天奈科技", "普元信息", "西部超导", "聚辰股份", "沪硅产业", "中国电研", "清溢光电", "海尔生物", "先惠技术", "松井股份", "优刻得", "有方科技", "埃夫特", "博瑞医药", "安博通", "石头科技", "百奥泰", "万德斯", "君实生物", "八亿时空", "康希诺", "广大特材", "柏楚电子", "南新制药", "卓越新能", "佰仁医疗", "久日新材", "华峰测控", "美迪西", "道通科技", "江苏北人", "成都先导", "开普云", "博睿数据", "神工股份", "寒武纪", "卓易信息", "泽璟制药", "华特气体", "天智航", "特宝生物", "敏芯股份", "鸿泉物联", "东方生物", "长阳科技", "联瑞新材", "恒誉环保", "迈得医疗", "盟升电子", "燕麦科技", "仕佳光子", "财富趋势", "微芯生物", "铂力特", "复洁环保", "三生国健", "赛科希德", "亿华通", "建龙微纳", "祥生医疗", "德马科技", "华熙生物", "光云科技", "昊海生科", "晶丰明源", "致远互联", "迪威尔", "华光新材", "嘉元科技", "普门科技", "安必平", "华润微", "赛特新材", "硕世生物", "震有科技", "金科环境", "艾迪药业", "慧辰资讯", "复旦张江", "芯朋微", "奥特维", "联赢激光", "南亚新材", "神州细胞", "芯原股份", "秦川物联", "泽达易盛", "高测股份", "国盛智科", "奇安信", "吉贝尔", "孚能科技", "中科星图", "山大地纬", "伟思医疗", "江航装备", "凌志软件", "力合微", "正帆科技", "金博股份", "天合光能", "皖仪科技", "中芯国际"];
let allStockMap = {"平安银行": "000001", "万科A": "000002", "国农科技": "000004", "世纪星源": "000005", "深振业A": "000006", "全新好": "000007", "神州高铁": "000008", "中国宝安": "000009", "美丽生态": "000010", "深物业A": "000011", "南玻A": "000012", "沙河股份": "000014", "深康佳A": "000016", "*ST中华A": "000017", "深粮控股": "000019", "深华发A": "000020", "深科技": "000021", "深天地A": "000023", "特力A": "000025", "飞亚达": "000026", "深圳能源": "000027", "国药一致": "000028", "深深房A": "000029", "富奥股份": "000030", "大悦城": "000031", "深桑达A": "000032", "神州数码": "000034", "中国天楹": "000035", "华联控股": "000036", "深南电A": "000037", "深大通": "000038", "中集集团": "000039", "东旭蓝天": "000040", "中洲控股": "000042", "深纺织A": "000045", "泛海控股": "000046", "京基智农": "000048", "德赛电池": "000049", "深天马A": "000050", "方大集团": "000055", "皇庭国际": "000056", "深赛格": "000058", "华锦股份": "000059", "中金岭南": "000060", "农产品": "000061", "深圳华强": "000062", "中兴通讯": "000063", "北方国际": "000065", "中国长城": "000066", "华控赛格": "000068", "华侨城A": "000069", "特发信息": "000070", "海王生物": "000078", "盐田港": "000088", "深圳机场": "000089", "天健集团": "000090", "广聚能源": "000096", "中信海直": "000099", "TCL科技": "000100", "宜华健康": "000150", "中成股份": "000151", "丰原药业": "000153", "川能动力": "000155", "华数传媒": "000156", "中联重科": "000157", "常山北明": "000158", "国际实业": "000159", "申万宏源": "000166", "东方盛虹": "000301", "美的集团": "000333", "潍柴动力": "000338", "许继电气": "000400", "冀东水泥": "000401", "金融街": "000402", "双林生物": "000403", "长虹华意": "000404", "胜利股份": "000407", "*ST藏格": "000408", "ST地矿": "000409", "*ST沈机": "000410", "英特集团": "000411", "东旭光电": "000413", "渤海租赁": "000415", "民生控股": "000416", "合肥百货": "000417", "通程控股": "000419", "吉林化纤": "000420", "南京公用": "000421", "ST宜化": "000422", "东阿阿胶": "000423", "徐工机械": "000425", "兴业矿业": "000426", "华天酒店": "000428", "粤高速A": "000429", "张家界": "000430", "晨鸣纸业": "000488", "山东路桥": "000498", "鄂武商A": "000501", "绿景控股": "000502", "国新健康": "000503", "ST生物": "000504", "京粮控股": "000505", "中润资源": "000506", "珠海港": "000507", "*ST华塑": "000509", "新金路": "000510", "丽珠集团": "000513", "渝开发": "000514", "国际医学": "000516", "荣安地产": "000517", "四环生物": "000518", "中兵红箭": "000519", "长航凤凰": "000520", "长虹美菱": "000521", "广州浪奇": "000523", "岭南控股": "000524", "红太阳": "000525", "紫光学大": "000526", "柳工": "000528", "广弘控股": "000529", "冰山冷热": "000530", "穗恒运A": "000531", "华金资本": "000532", "顺钠股份": "000533", "万泽股份": "000534", "*ST华映": "000536", "广宇发展": "000537", "云南白药": "000538", "粤电力A": "000539", "中天金融": "000540", "佛山照明": "000541", "皖能电力": "000543", "中原环保": "000544", "金浦钛业": "000545", "金圆股份": "000546", "航天发展": "000547", "湖南投资": "000548", "江铃汽车": "000550", "创元科技": "000551", "靖远煤电": "000552", "安道麦A": "000553", "泰山石油": "000554", "神州信息": "000555", "西部创业": "000557", "莱茵体育": "000558", "万向钱潮": "000559", "我爱我家": "000560", "烽火电子": "000561", "陕国投A": "000563", "供销大集": "000564", "渝三峡A": "000565", "海南海药": "000566", "海德股份": "000567", "泸州老窖": "000568", "苏常柴A": "000570", "*ST大洲": "000571", "ST海马": "000572", "粤宏远A": "000573", "广东甘化": "000576", "威孚高科": "000581", "北部湾港": "000582", "哈工智能": "000584", "*ST东电": "000585", "汇源通信": "000586", "*ST金洲": "000587", "贵州轮胎": "000589", "启迪古汉": "000590", "太阳能": "000591", "平潭发展": "000592", "大通燃气": "000593", "*ST宝实": "000595", "古井贡酒": "000596", "东北制药": "000597", "兴蓉环境": "000598", "青岛双星": "000599", "建投能源": "000600", "韶能股份": "000601", "盛达资源": "000603", "渤海股份": "000605", "顺利办": "000606", "华媒控股": "000607", "阳光股份": "000608", "中迪投资": "000609", "西安旅游": "000610", "ST天首": "000611", "焦作万方": "000612", "大东海A": "000613", "京汉股份": "000615", "海航投资": "000616", "中油资本": "000617", "海螺型材": "000619", "新华联": "000620", "恒立实业": "000622", "吉林敖东": "000623", "长安汽车": "000625", "远大控股": "000626", "天茂集团": "000627", "高新发展": "000628", "攀钢钒钛": "000629", "铜陵有色": "000630", "顺发恒业": "000631", "三木集团": "000632", "合金投资": "000633", "英力特": "000635", "风华高科": "000636", "茂化实华": "000637", "万方发展": "000638", "西王食品": "000639", "仁和药业": "000650", "格力电器": "000651", "泰达股份": "000652", "金岭矿业": "000655", "金科股份": "000656", "中钨高新": "000657", "珠海中富": "000659", "长春高新": "000661", "*ST天夏": "000662", "*ST永林": "000663", "湖北广电": "000665", "经纬纺机": "000666", "美好置业": "000667", "荣丰控股": "000668", "*ST金鸿": "000669", "*ST盈方": "000670", "阳光城": "000671", "上峰水泥": "000672", "*ST当代": "000673", "智度股份": "000676", "恒天海龙": "000677", "襄阳轴承": "000678", "*ST友谊": "000679", "山推股份": "000680", "视觉中国": "000681", "东方电子": "000682", "远兴能源": "000683", "中山公用": "000685", "东北证券": "000686", "*ST华讯": "000687", "国城矿业": "000688", "宝新能源": "000690", "亚太实业": "000691", "惠天热电": "000692", "滨海能源": "000695", "炼石航空": "000697", "沈阳化工": "000698", "模塑科技": "000700", "厦门信达": "000701", "正虹科技": "000702", "恒逸石化": "000703", "浙江震元": "000705", "ST双环": "000707", "中信特钢": "000708", "河钢股份": "000709", "贝瑞基因": "000710", "京蓝科技": "000711", "锦龙股份": "000712", "丰乐种业": "000713", "中兴商业": "000715", "黑芝麻": "000716", "韶钢松山": "000717", "苏宁环球": "000718", "中原传媒": "000719", "新能泰山": "000720", "西安饮食": "000721", "湖南发展": "000722", "美锦能源": "000723", "京东方A": "000725", "鲁泰A": "000726", "*ST东科": "000727", "国元证券": "000728", "燕京啤酒": "000729", "四川美丰": "000731", "泰禾集团": "000732", "振华科技": "000733", "罗牛山": "000735", "中交地产": "000736", "ST南风": "000737", "航发控制": "000738", "普洛药业": "000739", "国海证券": "000750", "锌业股份": "000751", "*ST西发": "000752", "漳州发展": "000753", "山西路桥": "000755", "新华制药": "000756", "浩物股份": "000757", "中色股份": "000758", "中百集团": "000759", "*ST斯太": "000760", "本钢板材": "000761", "西藏矿业": "000762", "通化金马": "000766", "漳泽电力": "000767", "中航飞机": "000768", "广发证券": "000776", "中核科技": "000777", "新兴铸管": "000778", "甘咨询": "000779", "*ST平能": "000780", "美达股份": "000782", "长江证券": "000783", "居然之家": "000785", "北新建材": "000786", "北大医药": "000788", "万年青": "000789", "华神科技": "000790", "甘肃电投": "000791", "*ST盐湖": "000792", "华闻集团": "000793", "英洛华": "000795", "凯撒旅业": "000796", "中国武夷": "000797", "中水渔业": "000798", "酒鬼酒": "000799", "一汽解放": "000800", "四川九洲": "000801", "北京文化": "000802", "*ST北能": "000803", "*ST银河": "000806", "云铝股份": "000807", "铁岭新城": "000809", "创维数字": "000810", "冰轮环境": "000811", "陕西金叶": "000812", "德展健康": "000813", "美利云": "000815", "ST慧业": "000816", "航锦科技": "000818", "岳阳兴长": "000819", "*ST节能": "000820", "京山轻机": "000821", "山东海化": "000822", "超声电子": "000823", "太钢不锈": "000825", "启迪环境": "000826", "东莞控股": "000828", "天音控股": "000829", "鲁西化工": "000830", "五矿稀土": "000831", "粤桂股份": "000833", "*ST长动": "000835", "富通鑫茂": "000836", "*ST秦机": "000837", "财信发展": "000838", "中信国安": "000839", "承德露露": "000848", "华茂股份": "000850", "高鸿股份": "000851", "石化机械": "000852", "冀东装备": "000856", "五粮液": "000858", "国风塑业": "000859", "顺鑫农业": "000860", "海印股份": "000861", "银星能源": "000862", "三湘印象": "000863", "ST安凯": "000868", "张裕A": "000869", "吉电股份": "000875", "新希望": "000876", "天山股份": "000877", "云南铜业": "000878", "潍柴重机": "000880", "中广核技": "000881", "华联股份": "000882", "湖北能源": "000883", "城发环境": "000885", "海南高速": "000886", "中鼎股份": "000887", "峨眉山A": "000888", "中嘉博创": "000889", "*ST胜尔": "000890", "欢瑞世纪": "000892", "东凌国际": "000893", "双汇发展": "000895", "津滨发展": "000897", "鞍钢股份": "000898", "赣能股份": "000899", "现代投资": "000900", "航天科技": "000901", "新洋丰": "000902", "云内动力": "000903", "厦门港务": "000905", "浙商中拓": "000906", "景峰医药": "000908", "数源科技": "000909", "大亚圣象": "000910", "ST南糖": "000911", "泸天化": "000912", "钱江摩托": "000913", "山大华特": "000915", "电广传媒": "000917", "嘉凯城": "000918", "金陵药业": "000919", "南方汇通": "000920", "海信家电": "000921", "佳电股份": "000922", "河钢资源": "000923", "众合科技": "000925", "福星股份": "000926", "*ST夏利": "000927", "中钢国际": "000928", "兰州黄河": "000929", "中粮科技": "000930", "中关村": "000931", "华菱钢铁": "000932", "神火股份": "000933", "四川双马": "000935", "华西股份": "000936", "冀中能源": "000937", "紫光股份": "000938", "*ST凯迪": "000939", "南天信息": "000948", "新乡化纤": "000949", "重药控股": "000950", "中国重汽": "000951", "广济药业": "000952", "*ST河化": "000953", "欣龙控股": "000955", "中通客车": "000957", "东方能源": "000958", "首钢股份": "000959", "锡业股份": "000960", "中南建设": "000961", "东方钽业": "000962", "华东医药": "000963", "天保基建": "000965", "长源电力": "000966", "盈峰环境": "000967", "蓝焰控股": "000968", "安泰科技": "000969", "中科三环": "000970", "*ST高升": "000971", "ST中基": "000972", "佛塑科技": "000973", "银泰黄金": "000975", "华铁股份": "000976", "浪潮信息": "000977", "桂林旅游": "000978", "*ST众泰": "000980", "*ST银亿": "000981", "*ST中绒": "000982", "西山煤电": "000983", "大庆华科": "000985", "越秀金控": "000987", "华工科技": "000988", "九芝堂": "000989", "诚志股份": "000990", "闽东电力": "000993", "*ST皇台": "000995", "中国中期": "000996", "新大陆": "000997", "隆平高科": "000998", "华润三九": "000999", "宗申动力": "001696", "招商港口": "001872", "豫能控股": "001896", "招商积余": "001914", "招商公路": "001965", "招商蛇口": "001979", "新和成": "002001", "鸿达兴业": "002002", "伟星股份": "002003", "华邦健康": "002004", "*ST德豪": "002005", "精功科技": "002006", "华兰生物": "002007", "大族激光": "002008", "天奇股份": "002009", "传化智联": "002010", "盾安环境": "002011", "凯恩股份": "002012", "中航机电": "002013", "永新股份": "002014", "协鑫能科": "002015", "世荣兆业": "002016", "东信和平": "002017", "亿帆医药": "002019", "京新药业": "002020", "ST中捷": "002021", "科华生物": "002022", "海特高新": "002023", "苏宁易购": "002024", "航天电器": "002025", "山东威达": "002026", "分众传媒": "002027", "思源电气": "002028", "七匹狼": "002029", "达安基因": "002030", "巨轮智能": "002031", "苏泊尔": "002032", "丽江股份": "002033", "旺能环境": "002034", "华帝股份": "002035", "联创电子": "002036", "保利联合": "002037", "双鹭药业": "002038", "黔源电力": "002039", "南京港": "002040", "登海种业": "002041", "华孚时尚": "002042", "兔宝宝": "002043", "美年健康": "002044", "国光电器": "002045", "轴研科技": "002046", "宝鹰股份": "002047", "宁波华翔": "002048", "紫光国微": "002049", "三花智控": "002050", "中工国际": "002051", "*ST同洲": "002052", "云南能投": "002053", "德美化工": "002054", "得润电子": "002055", "横店东磁": "002056", "中钢天源": "002057", "威尔泰": "002058", "云南旅游": "002059", "粤水电": "002060", "浙江交科": "002061", "宏润建设": "002062", "远光软件": "002063", "华峰氨纶": "002064", "东华软件": "002065", "瑞泰科技": "002066", "景兴纸业": "002067", "黑猫股份": "002068", "獐子岛": "002069", "*ST长城": "002071", "ST凯瑞": "002072", "软控股份": "002073", "国轩高科": "002074", "沙钢股份": "002075", "*ST雪莱": "002076", "*ST大港": "002077", "太阳纸业": "002078", "苏州固锝": "002079", "中材科技": "002080", "金螳螂": "002081", "万邦德": "002082", "孚日股份": "002083", "海鸥住工": "002084", "万丰奥威": "002085", "*ST东洋": "002086", "新野纺织": "002087", "鲁阳节能": "002088", "ST新海": "002089", "金智科技": "002090", "江苏国泰": "002091", "中泰化学": "002092", "国脉科技": "002093", "青岛金王": "002094", "生意宝": "002095", "南岭民爆": "002096", "山河智能": "002097", "浔兴股份": "002098", "海翔药业": "002099", "天康生物": "002100", "广东鸿图": "002101", "ST冠福": "002102", "广博股份": "002103", "恒宝股份": "002104", "信隆健康": "002105", "莱宝高科": "002106", "沃华医药": "002107", "沧州明珠": "002108", "兴化股份": "002109", "三钢闽光": "002110", "威海广泰": "002111", "三变科技": "002112", "*ST天润": "002113", "罗平锌电": "002114", "三维通信": "002115", "中国海诚": "002116", "东港股份": "002117", "紫鑫药业": "002118", "康强电子": "002119", "韵达股份": "002120", "*ST科陆": "002121", "*ST天马": "002122", "梦网集团": "002123", "天邦股份": "002124", "湘潭电化": "002125", "银轮股份": "002126", "南极电商": "002127", "露天煤业": "002128", "中环股份": "002129", "沃尔核材": "002130", "利欧股份": "002131", "恒星科技": "002132", "广宇集团": "002133", "天津普林": "002134", "东南网架": "002135", "安纳达": "002136", "麦达数字": "002137", "顺络电子": "002138", "拓邦股份": "002139", "东华科技": "002140", "贤丰控股": "002141", "宁波银行": "002142", "宏达高科": "002144", "中核钛白": "002145", "荣盛发展": "002146", "*ST新光": "002147", "北纬科技": "002148", "西部材料": "002149", "通润装备": "002150", "北斗星通": "002151", "广电运通": "002152", "石基信息": "002153", "报喜鸟": "002154", "湖南黄金": "002155", "通富微电": "002156", "正邦科技": "002157", "汉钟精机": "002158", "三特索道": "002159", "常铝股份": "002160", "远望谷": "002161", "悦心健康": "002162", "海南发展": "002163", "宁波东力": "002164", "红宝丽": "002165", "莱茵生物": "002166", "东方锆业": "002167", "惠程科技": "002168", "智光电气": "002169", "芭田股份": "002170", "楚江新材": "002171", "澳洋健康": "002172", "创新医疗": "002173", "游族网络": "002174", "*ST东网": "002175", "*ST江特": "002176", "御银股份": "002177", "延华智能": "002178", "中航光电": "002179", "纳思达": "002180", "粤传媒": "002181", "云海金属": "002182", "怡亚通": "002183", "海得控制": "002184", "华天科技": "002185", "全聚德": "002186", "广百股份": "002187", "ST巴士": "002188", "中光学": "002189", "成飞集成": "002190", "劲嘉股份": "002191", "*ST融捷": "002192", "如意集团": "002193", "武汉凡谷": "002194", "二三四五": "002195", "方正电机": "002196", "证通电子": "002197", "嘉应制药": "002198", "东晶电子": "002199", "ST云投": "002200", "九鼎新材": "002201", "金风科技": "002202", "海亮股份": "002203", "大连重工": "002204", "国统股份": "002205", "海利得": "002206", "准油股份": "002207", "合肥城建": "002208", "达意隆": "002209", "*ST飞马": "002210", "宏达新材": "002211", "南洋股份": "002212", "大为股份": "002213", "大立科技": "002214", "诺普信": "002215", "三全食品": "002216", "合力泰": "002217", "拓日新能": "002218", "*ST恒康": "002219", "东华能源": "002221", "福晶科技": "002222", "鱼跃医疗": "002223", "三力士": "002224", "濮耐股份": "002225", "江南化工": "002226", "奥特迅": "002227", "合兴包装": "002228", "鸿博股份": "002229", "科大讯飞": "002230", "奥维通信": "002231", "启明信息": "002232", "塔牌集团": "002233", "民和股份": "002234", "安妮股份": "002235", "大华股份": "002236", "恒邦股份": "002237", "天威视讯": "002238", "奥特佳": "002239", "威华股份": "002240", "歌尔股份": "002241", "九阳股份": "002242", "通产丽星": "002243", "滨江集团": "002244", "澳洋顺昌": "002245", "北化股份": "002246", "*ST聚力": "002247", "华东数控": "002248", "大洋电机": "002249", "联化科技": "002250", "步步高": "002251", "上海莱士": "002252", "川大智胜": "002253", "泰和新材": "002254", "*ST海陆": "002255", "*ST兆新": "002256", "利尔化学": "002258", "*ST升达": "002259", "*ST德奥": "002260", "拓维信息": "002261", "恩华药业": "002262", "大东南": "002263", "新华都": "002264", "西仪股份": "002265", "浙富控股": "002266", "陕天然气": "002267", "卫士通": "002268", "美邦服饰": "002269", "华明装备": "002270", "东方雨虹": "002271", "川润股份": "002272", "水晶光电": "002273", "华昌化工": "002274", "桂林三金": "002275", "万马股份": "002276", "友阿股份": "002277", "神开股份": "002278", "久其软件": "002279", "*ST联络": "002280", "光迅科技": "002281", "博深股份": "002282", "天润工业": "002283", "亚太股份": "002284", "世联行": "002285", "保龄宝": "002286", "奇正藏药": "002287", "超华科技": "002288", "ST宇顺": "002289", "ST中科创": "002290", "星期六": "002291", "奥飞娱乐": "002292", "罗莱生活": "002293", "信立泰": "002294", "精艺股份": "002295", "辉煌科技": "002296", "博云新材": "002297", "中电兴发": "002298", "圣农发展": "002299", "太阳电缆": "002300", "齐心集团": "002301", "西部建设": "002302", "美盈森": "002303", "洋河股份": "002304", "南国置业": "002305", "ST云网": "002306", "北新路桥": "002307", "威创股份": "002308", "中利集团": "002309", "东方园林": "002310", "海大集团": "002311", "三泰控股": "002312", "日海智能": "002313", "南山控股": "002314", "焦点科技": "002315", "亚联发展": "002316", "众生药业": "002317", "久立特材": "002318", "*ST乐通": "002319", "海峡股份": "002320", "华英农业": "002321", "理工环科": "002322", "*ST雅博": "002323", "普利特": "002324", "洪涛股份": "002325", "永太科技": "002326", "富安娜": "002327", "新朋股份": "002328", "皇氏集团": "002329", "得利斯": "002330", "皖通科技": "002331", "仙琚制药": "002332", "ST罗普": "002333", "英威腾": "002334", "科华恒盛": "002335", "ST人乐": "002336", "赛象科技": "002337", "奥普光电": "002338", "积成电子": "002339", "格林美": "002340", "新纶科技": "002341", "巨力索具": "002342", "慈文传媒": "002343", "海宁皮城": "002344", "潮宏基": "002345", "柘中股份": "002346", "泰尔股份": "002347", "高乐股份": "002348", "精华制药": "002349", "北京科锐": "002350", "漫步者": "002351", "顺丰控股": "002352", "杰瑞股份": "002353", "*ST天娱": "002354", "兴民智通": "002355", "*ST赫美": "002356", "富临运业": "002357", "森源电气": "002358", "*ST北讯": "002359", "同德化工": "002360", "神剑股份": "002361", "汉王科技": "002362", "隆基机械": "002363", "中恒电气": "002364", "永安药业": "002365", "台海核电": "002366", "康力电梯": "002367", "太极股份": "002368", "卓翼科技": "002369", "亚太药业": "002370", "北方华创": "002371", "伟星新材": "002372", "千方科技": "002373", "丽鹏股份": "002374", "亚厦股份": "002375", "新北洋": "002376", "国创高新": "002377", "章源钨业": "002378", "宏创控股": "002379", "科远智慧": "002380", "双箭股份": "002381", "蓝帆医疗": "002382", "合众思壮": "002383", "东山精密": "002384", "大北农": "002385", "天原集团": "002386", "维信诺": "002387", "新亚制程": "002388", "航天彩虹": "002389", "信邦制药": "002390", "长青股份": "002391", "北京利尔": "002392", "力生制药": "002393", "联发股份": "002394", "双象股份": "002395", "星网锐捷": "002396", "梦洁股份": "002397", "垒知集团": "002398", "海普瑞": "002399", "省广集团": "002400", "中远海科": "002401", "和而泰": "002402", "爱仕达": "002403", "嘉欣丝绸": "002404", "四维图新": "002405", "远东传动": "002406", "多氟多": "002407", "齐翔腾达": "002408", "雅克科技": "002409", "广联达": "002410", "延安必康": "002411", "汉森制药": "002412", "雷科防务": "002413", "高德红外": "002414", "海康威视": "002415", "爱施德": "002416", "深南股份": "002417", "*ST康盛": "002418", "天虹股份": "002419", "ST毅昌": "002420", "达实智能": "002421", "科伦药业": "002422", "中粮资本": "002423", "贵州百灵": "002424", "凯撒文化": "002425", "*ST胜利": "002426", "ST尤夫": "002427", "云南锗业": "002428", "兆驰股份": "002429", "杭氧股份": "002430", "棕榈股份": "002431", "九安医疗": "002432", "太安堂": "002433", "万里扬": "002434", "长江健康": "002435", "兴森科技": "002436", "誉衡药业": "002437", "江苏神通": "002438", "启明星辰": "002439", "闰土股份": "002440", "众业达": "002441", "龙星化工": "002442", "金洲管道": "002443", "巨星科技": "002444", "*ST中南": "002445", "盛路通信": "002446", "*ST晨鑫": "002447", "中原内配": "002448", "国星光电": "002449", "*ST康得": "002450", "摩恩电气": "002451", "长高集团": "002452", "华软科技": "002453", "松芝股份": "002454", "百川股份": "002455", "欧菲光": "002456", "青龙管业": "002457", "益生股份": "002458", "晶澳科技": "002459", "赣锋锂业": "002460", "珠江啤酒": "002461", "嘉事堂": "002462", "沪电股份": "002463", "众应互联": "002464", "海格通信": "002465", "天齐锂业": "002466", "二六三": "002467", "申通快递": "002468", "三维工程": "002469", "*ST金正": "002470", "中超控股": "002471", "双环传动": "002472", "ST圣莱": "002473", "榕基软件": "002474", "立讯精密": "002475", "宝莫股份": "002476", "常宝股份": "002478", "富春环保": "002479", "新筑股份": "002480", "双塔食品": "002481", "广田集团": "002482", "润邦股份": "002483", "江海股份": "002484", "希努尔": "002485", "嘉麟杰": "002486", "大金重工": "002487", "金固股份": "002488", "浙江永强": "002489", "山东墨龙": "002490", "通鼎互联": "002491", "恒基达鑫": "002492", "荣盛石化": "002493", "华斯股份": "002494", "佳隆股份": "002495", "*ST辉丰": "002496", "雅化集团": "002497", "汉缆股份": "002498", "*ST科林": "002499", "山西证券": "002500", "*ST利源": "002501", "*ST鼎龙": "002502", "搜于特": "002503", "弘高创意": "002504", "大康农业": "002505", "协鑫集成": "002506", "涪陵榨菜": "002507", "老板电器": "002508", "天汽模": "002510", "中顺洁柔": "002511", "达华智能": "002512", "*ST蓝丰": "002513", "宝馨科技": "002514", "金字火腿": "002515", "旷达科技": "002516", "恺英网络": "002517", "科士达": "002518", "银河电子": "002519", "日发精机": "002520", "齐峰新材": "002521", "浙江众成": "002522", "天桥起重": "002523", "光正集团": "002524", "山东矿机": "002526", "新时达": "002527", "英飞拓": "002528", "*ST海源": "002529", "金财互联": "002530", "天顺风能": "002531", "新界泵业": "002532", "金杯电工": "002533", "杭锅股份": "002534", "*ST林重": "002535", "飞龙股份": "002536", "海联金汇": "002537", "司尔特": "002538", "云图控股": "002539", "亚太科技": "002540", "鸿路钢构": "002541", "中化岩土": "002542", "万和电气": "002543", "杰赛科技": "002544", "东方铁塔": "002545", "新联电子": "002546", "春兴精工": "002547", "金新农": "002548", "凯美特气": "002549", "千红制药": "002550", "尚荣医疗": "002551", "宝鼎科技": "002552", "南方轴承": "002553", "惠博普": "002554", "三七互娱": "002555", "辉隆股份": "002556", "洽洽食品": "002557", "巨人网络": "002558", "亚威股份": "002559", "通达股份": "002560", "徐家汇": "002561", "兄弟科技": "002562", "森马服饰": "002563", "天沃科技": "002564", "顺灏股份": "002565", "益盛药业": "002566", "唐人神": "002567", "百润股份": "002568", "ST步森": "002569", "贝因美": "002570", "德力股份": "002571", "索菲亚": "002572", "清新环境": "002573", "明牌珠宝": "002574", "*ST群兴": "002575", "通达动力": "002576", "雷柏科技": "002577", "闽发铝业": "002578", "中京电子": "002579", "圣阳股份": "002580", "未名医药": "002581", "好想你": "002582", "海能达": "002583", "西陇科学": "002584", "双星新材": "002585", "*ST围海": "002586", "奥拓电子": "002587", "史丹利": "002588", "瑞康医药": "002589", "万安科技": "002590", "恒大高新": "002591", "ST八菱": "002592", "日上集团": "002593", "比亚迪": "002594", "豪迈科技": "002595", "海南瑞泽": "002596", "金禾实业": "002597", "山东章鼓": "002598", "盛通股份": "002599", "领益智造": "002600", "龙蟒佰利": "002601", "世纪华通": "002602", "以岭药业": "002603", "姚记科技": "002605", "大连电瓷": "002606", "中公教育": "002607", "江苏国信": "002608", "捷顺科技": "002609", "爱康科技": "002610", "东方精工": "002611", "朗姿股份": "002612", "北玻股份": "002613", "奥佳华": "002614", "哈尔斯": "002615", "长青集团": "002616", "露笑科技": "002617", "丹邦科技": "002618", "艾格拉斯": "002619", "瑞和股份": "002620", "美吉姆": "002621", "融钰集团": "002622", "亚玛顿": "002623", "完美世界": "002624", "光启技术": "002625", "金达威": "002626", "宜昌交运": "002627", "成都路桥": "002628", "*ST仁智": "002629", "华西能源": "002630", "德尔未来": "002631", "道明光学": "002632", "申科股份": "002633", "棒杰股份": "002634", "安洁科技": "002635", "金安国纪": "002636", "赞宇科技": "002637", "*ST勤上": "002638", "雪人股份": "002639", "跨境通": "002640", "永高股份": "002641", "荣联科技": "002642", "万润股份": "002643", "佛慈制药": "002644", "华宏科技": "002645", "青青稞酒": "002646", "仁东控股": "002647", "卫星石化": "002648", "博彦科技": "002649", "ST加加": "002650", "利君股份": "002651", "扬子新材": "002652", "海思科": "002653", "万润科技": "002654", "共达电声": "002655", "ST摩登": "002656", "中科金财": "002657", "雪迪龙": "002658", "凯文教育": "002659", "茂硕电源": "002660", "克明面业": "002661", "京威股份": "002662", "普邦股份": "002663", "长鹰信质": "002664", "首航高科": "002665", "德联集团": "002666", "鞍重股份": "002667", "奥马电器": "002668", "康达新材": "002669", "国盛金控": "002670", "龙泉股份": "002671", "东江环保": "002672", "西部证券": "002673", "兴业科技": "002674", "东诚药业": "002675", "顺威股份": "002676", "浙江美大": "002677", "珠江钢琴": "002678", "福建金森": "002679", "*ST奋达": "002681", "龙洲股份": "002682", "宏大爆破": "002683", "*ST猛狮": "002684", "华东重机": "002685", "亿利达": "002686", "乔治白": "002687", "金河生物": "002688", "远大智能": "002689", "美亚光电": "002690", "冀凯股份": "002691", "ST远程": "002692", "双成药业": "002693", "顾地科技": "002694", "煌上煌": "002695", "百洋股份": "002696", "红旗连锁": "002697", "博实股份": "002698", "美盛文化": "002699", "ST浩源": "002700", "奥瑞金": "002701", "海欣食品": "002702", "浙江世宝": "002703", "新宝股份": "002705", "良信电器": "002706", "众信旅游": "002707", "光洋股份": "002708", "天赐材料": "002709", "*ST欧浦": "002711", "思美传媒": "002712", "东易日盛": "002713", "牧原股份": "002714", "登云股份": "002715", "*ST金贵": "002716", "岭南股份": "002717", "友邦吊顶": "002718", "*ST麦趣": "002719", "金一文化": "002721", "金轮股份": "002722", "金莱特": "002723", "海洋王": "002724", "跃岭股份": "002725", "龙大肉食": "002726", "一心堂": "002727", "特一药业": "002728", "好利来": "002729", "电光科技": "002730", "萃华珠宝": "002731", "燕塘乳业": "002732", "雄韬股份": "002733", "利民股份": "002734", "王子新材": "002735", "国信证券": "002736", "葵花药业": "002737", "中矿资源": "002738", "万达电影": "002739", "爱迪尔": "002740", "光华科技": "002741", "三圣股份": "002742", "富煌钢构": "002743", "木林森": "002745", "仙坛股份": "002746", "埃斯顿": "002747", "世龙实业": "002748", "国光股份": "002749", "龙津药业": "002750", "易尚展示": "002751", "昇兴股份": "002752", "永东股份": "002753", "奥赛康": "002755", "永兴材料": "002756", "南兴股份": "002757", "华通医药": "002758", "天际股份": "002759", "凤形股份": "002760", "多喜爱": "002761", "金发拉比": "002762", "汇洁股份": "002763", "蓝黛传动": "002765", "*ST索菱": "002766", "先锋电子": "002767", "国恩股份": "002768", "普路通": "002769", "ST科迪": "002770", "真视通": "002771", "众兴菌业": "002772", "康弘药业": "002773", "快意电梯": "002774", "文科园林": "002775", "柏堡龙": "002776", "久远银海": "002777", "高科石化": "002778", "中坚科技": "002779", "三夫户外": "002780", "奇信股份": "002781", "可立克": "002782", "凯龙股份": "002783", "万里石": "002785", "银宝山新": "002786", "华源控股": "002787", "鹭燕医药": "002788", "建艺集团": "002789", "瑞尔特": "002790", "坚朗五金": "002791", "通宇通讯": "002792", "罗欣药业": "002793", "永和智控": "002795", "世嘉科技": "002796", "第一创业": "002797", "帝欧家居": "002798", "环球印务": "002799", "天顺股份": "002800", "微光股份": "002801", "洪汇新材": "002802", "吉宏股份": "002803", "丰元股份": "002805", "华锋股份": "002806", "江阴银行": "002807", "恒久科技": "002808", "红墙股份": "002809", "山东赫达": "002810", "郑中设计": "002811", "恩捷股份": "002812", "路畅科技": "002813", "崇达技术": "002815", "和科达": "002816", "黄山胶囊": "002817", "富森美": "002818", "东方中科": "002819", "桂发祥": "002820", "凯莱英": "002821", "中装建设": "002822", "凯中精密": "002823", "和胜股份": "002824", "纳尔股份": "002825", "易明医药": "002826", "高争民爆": "002827", "贝肯能源": "002828", "星网宇达": "002829", "名雕股份": "002830", "裕同科技": "002831", "比音勒芬": "002832", "弘亚数控": "002833", "同为股份": "002835", "新宏泽": "002836", "英维克": "002837", "道恩股份": "002838", "张家港行": "002839", "华统股份": "002840", "视源股份": "002841", "翔鹭钨业": "002842", "泰嘉股份": "002843", "同兴达": "002845", "英联股份": "002846", "盐津铺子": "002847", "高斯贝尔": "002848", "威星智能": "002849", "科达利": "002850", "麦格米特": "002851", "道道全": "002852", "皮阿诺": "002853", "捷荣技术": "002855", "美芝股份": "002856", "三晖电气": "002857", "力盛赛车": "002858", "洁美科技": "002859", "星帅尔": "002860", "瀛通通讯": "002861", "实丰文化": "002862", "今飞凯达": "002863", "盘龙药业": "002864", "钧达股份": "002865", "传艺科技": "002866", "周大生": "002867", "绿康生化": "002868", "金溢科技": "002869", "香山股份": "002870", "伟隆股份": "002871", "ST天圣": "002872", "新天药业": "002873", "安奈儿": "002875", "三利谱": "002876", "智能自控": "002877", "元隆雅图": "002878", "长缆科技": "002879", "卫光生物": "002880", "美格智能": "002881", "金龙羽": "002882", "中设股份": "002883", "凌霄泵业": "002884", "京泉华": "002885", "沃特股份": "002886", "绿茵生态": "002887", "惠威科技": "002888", "东方嘉盛": "002889", "弘宇股份": "002890", "中宠股份": "002891", "科力尔": "002892", "华通热力": "002893", "川恒股份": "002895", "中大力德": "002896", "意华股份": "002897", "赛隆药业": "002898", "英派斯": "002899", "哈三联": "002900", "大博医疗": "002901", "铭普光磁": "002902", "宇环数控": "002903", "金逸影视": "002905", "华阳集团": "002906", "华森制药": "002907", "德生科技": "002908", "集泰股份": "002909", "庄园牧场": "002910", "佛燃能源": "002911", "中新赛克": "002912", "奥士康": "002913", "中欣氟材": "002915", "深南电路": "002916", "金奥博": "002917", "蒙娜丽莎": "002918", "名臣健康": "002919", "德赛西威": "002920", "联诚精密": "002921", "伊戈尔": "002922", "润都股份": "002923", "盈趣科技": "002925", "华西证券": "002926", "泰永长征": "002927", "华夏航空": "002928", "润建股份": "002929", "宏川智慧": "002930", "锋龙股份": "002931", "明德生物": "002932", "新兴装备": "002933", "天奥电子": "002935", "郑州银行": "002936", "兴瑞科技": "002937", "鹏鼎控股": "002938", "长城证券": "002939", "昂利康": "002940", "新疆交建": "002941", "新农股份": "002942", "宇晶股份": "002943", "华林证券": "002945", "新乳业": "002946", "恒铭达": "002947", "青岛银行": "002948", "华阳国际": "002949", "奥美医疗": "002950", "金时科技": "002951", "亚世光电": "002952", "日丰股份": "002953", "鸿合科技": "002955", "西麦食品": "002956", "科瑞技术": "002957", "青农商行": "002958", "小熊电器": "002959", "青鸟消防": "002960", "瑞达期货": "002961", "五方光电": "002962", "豪尔赛": "002963", "祥鑫科技": "002965", "苏州银行": "002966", "广电计量": "002967", "新大正": "002968", "嘉美包装": "002969", "锐明技术": "002970", "和远气体": "002971", "科安达": "002972", "侨银环保": "002973", "博杰股份": "002975", "瑞玛工业": "002976", "天箭科技": "002977", "安宁股份": "002978", "雷赛智能": "002979", "华盛昌": "002980", "朝阳科技": "002981", "湘佳股份": "002982", "芯瑞达": "002983", "北摩高科": "002985", "宇新股份": "002986", "京北方": "002987", "豪美新材": "002988", "中天精装": "002989", "盛视科技": "002990", "甘源食品": "002991", "宝明科技": "002992", "奥海科技": "002993", "天地在线": "002995", "中国广核": "003816", "特锐德": "300001", "神州泰岳": "300002", "乐普医疗": "300003", "南风股份": "300004", "探路者": "300005", "莱美药业": "300006", "汉威科技": "300007", "天海防务": "300008", "安科生物": "300009", "豆神教育": "300010", "鼎汉技术": "300011", "华测检测": "300012", "新宁物流": "300013", "亿纬锂能": "300014", "爱尔眼科": "300015", "北陆药业": "300016", "网宿科技": "300017", "中元股份": "300018", "硅宝科技": "300019", "银江股份": "300020", "大禹节水": "300021", "吉峰科技": "300022", "宝德股份": "300023", "机器人": "300024", "华星创业": "300025", "红日药业": "300026", "华谊兄弟": "300027", "天龙光电": "300029", "阳普医疗": "300030", "宝通科技": "300031", "金龙机电": "300032", "同花顺": "300033", "钢研高纳": "300034", "中科电气": "300035", "超图软件": "300036", "新宙邦": "300037", "数知科技": "300038", "上海凯宝": "300039", "九洲集团": "300040", "回天新材": "300041", "朗科科技": "300042", "星辉娱乐": "300043", "赛为智能": "300044", "华力创通": "300045", "台基股份": "300046", "天源迪科": "300047", "合康新能": "300048", "福瑞股份": "300049", "世纪鼎利": "300050", "三五互联": "300051", "中青宝": "300052", "欧比特": "300053", "鼎龙股份": "300054", "万邦达": "300055", "中创环保": "300056", "万顺新材": "300057", "蓝色光标": "300058", "东方财富": "300059", "旗天科技": "300061", "中能电气": "300062", "天龙集团": "300063", "豫金刚石": "300064", "海兰信": "300065", "三川智慧": "300066", "安诺其": "300067", "南都电源": "300068", "金利华电": "300069", "碧水源": "300070", "华谊嘉信": "300071", "三聚环保": "300072", "当升科技": "300073", "华平股份": "300074", "数字政通": "300075", "GQY视讯": "300076", "国民技术": "300077", "思创医惠": "300078", "数码科技": "300079", "易成新能": "300080", "恒信东方": "300081", "奥克股份": "300082", "创世纪": "300083", "海默科技": "300084", "银之杰": "300085", "康芝药业": "300086", "荃银高科": "300087", "长信科技": "300088", "文化长城": "300089", "金通灵": "300091", "科新机电": "300092", "金刚玻璃": "300093", "国联水产": "300094", "华伍股份": "300095", "易联众": "300096", "智云股份": "300097", "高新兴": "300098", "精准信息": "300099", "双林股份": "300100", "振芯科技": "300101", "乾照光电": "300102", "达刚控股": "300103", "龙源技术": "300105", "西部牧业": "300106", "建新股份": "300107", "吉药控股": "300108", "新开源": "300109", "华仁药业": "300110", "向日葵": "300111", "万讯自控": "300112", "顺网科技": "300113", "中航电测": "300114", "长盈精密": "300115", "坚瑞沃能": "300116", "嘉寓股份": "300117", "东方日升": "300118", "瑞普生物": "300119", "经纬辉开": "300120", "阳谷华泰": "300121", "智飞生物": "300122", "亚光科技": "300123", "汇川技术": "300124", "聆达股份": "300125", "锐奇股份": "300126", "银河磁体": "300127", "锦富技术": "300128", "泰胜风能": "300129", "新国都": "300130", "英唐智控": "300131", "青松股份": "300132", "华策影视": "300133", "大富科技": "300134", "宝利国际": "300135", "信维通信": "300136", "先河环保": "300137", "晨光生物": "300138", "晓程科技": "300139", "中环装备": "300140", "和顺电气": "300141", "沃森生物": "300142", "盈康生命": "300143", "宋城演艺": "300144", "中金环境": "300145", "汤臣倍健": "300146", "香雪制药": "300147", "天舟文化": "300148", "量子生物": "300149", "世纪瑞尔": "300150", "昌红科技": "300151", "科融环境": "300152", "科泰电源": "300153", "瑞凌股份": "300154", "安居宝": "300155", "恒泰艾普": "300157", "振东制药": "300158", "新研股份": "300159", "秀强股份": "300160", "华中数控": "300161", "雷曼光电": "300162", "先锋新材": "300163", "通源石油": "300164", "天瑞仪器": "300165", "东方国信": "300166", "迪威迅": "300167", "万达信息": "300168", "天晟新材": "300169", "汉得信息": "300170", "东富龙": "300171", "中电环保": "300172", "福能东方": "300173", "元力股份": "300174", "朗源股份": "300175", "派生科技": "300176", "中海达": "300177", "腾邦国际": "300178", "四方达": "300179", "华峰超纤": "300180", "佐力药业": "300181", "捷成股份": "300182", "东软载波": "300183", "力源信息": "300184", "通裕重工": "300185", "永清环保": "300187", "美亚柏科": "300188", "神农科技": "300189", "维尔利": "300190", "潜能恒信": "300191", "科斯伍德": "300192", "佳士科技": "300193", "福安药业": "300194", "长荣股份": "300195", "长海股份": "300196", "铁汉生态": "300197", "纳川股份": "300198", "翰宇药业": "300199", "高盟新材": "300200", "海伦哲": "300201", "聚龙股份": "300202", "聚光科技": "300203", "舒泰神": "300204", "天喻信息": "300205", "理邦仪器": "300206", "欣旺达": "300207", "青岛中程": "300208", "天泽信息": "300209", "森远股份": "300210", "亿通科技": "300211", "易华录": "300212", "佳讯飞鸿": "300213", "日科化学": "300214", "电科院": "300215", "千山退": "300216", "东方电热": "300217", "安利股份": "300218", "鸿利智汇": "300219", "金运激光": "300220", "银禧科技": "300221", "科大智能": "300222", "北京君正": "300223", "正海磁材": "300224", "金力泰": "300225", "上海钢联": "300226", "光韵达": "300227", "富瑞特装": "300228", "拓尔思": "300229", "永利股份": "300230", "银信科技": "300231", "洲明科技": "300232", "金城医药": "300233", "开尔新材": "300234", "方直科技": "300235", "上海新阳": "300236", "美晨生态": "300237", "冠昊生物": "300238", "东宝生物": "300239", "飞力达": "300240", "瑞丰光电": "300241", "佳云科技": "300242", "瑞丰高材": "300243", "迪安诊断": "300244", "天玑科技": "300245", "宝莱特": "300246", "融捷健康": "300247", "新开普": "300248", "依米康": "300249", "初灵信息": "300250", "光线传媒": "300251", "金信诺": "300252", "卫宁健康": "300253", "仟源医药": "300254", "常山药业": "300255", "星星科技": "300256", "开山股份": "300257", "精锻科技": "300258", "新天科技": "300259", "新莱应材": "300260", "雅本化学": "300261", "巴安水务": "300262", "隆华科技": "300263", "佳创视讯": "300264", "通光线缆": "300265", "兴源环境": "300266", "尔康制药": "300267", "佳沃股份": "300268", "联建光电": "300269", "中威电子": "300270", "华宇软件": "300271", "开能健康": "300272", "和佳医疗": "300273", "阳光电源": "300274", "梅安森": "300275", "三丰智能": "300276", "海联讯": "300277", "华昌达": "300278", "和晶科技": "300279", "紫天科技": "300280", "金明精机": "300281", "三盛教育": "300282", "温州宏丰": "300283", "苏交科": "300284", "国瓷材料": "300285", "安科瑞": "300286", "飞利信": "300287", "朗玛信息": "300288", "利德曼": "300289", "荣科科技": "300290", "华录百纳": "300291", "吴通控股": "300292", "蓝英装备": "300293", "博雅生物": "300294", "三六五网": "300295", "利亚德": "300296", "蓝盾股份": "300297", "三诺生物": "300298", "富春股份": "300299", "汉鼎宇佑": "300300", "长方集团": "300301", "同有科技": "300302", "聚飞光电": "300303", "云意电气": "300304", "裕兴股份": "300305", "远方信息": "300306", "慈星股份": "300307", "中际旭创": "300308", "吉艾科技": "300309", "宜通世纪": "300310", "任子行": "300311", "邦讯技术": "300312", "天山生物": "300313", "戴维医疗": "300314", "掌趣科技": "300315", "晶盛机电": "300316", "珈伟新能": "300317", "博晖创新": "300318", "麦捷科技": "300319", "海达股份": "300320", "同大股份": "300321", "硕贝德": "300322", "华灿光电": "300323", "旋极信息": "300324", "德威新材": "300325", "凯利泰": "300326", "中颖电子": "300327", "宜安科技": "300328", "海伦钢琴": "300329", "华虹计通": "300330", "苏大维格": "300331", "天壕环境": "300332", "兆日科技": "300333", "津膜科技": "300334", "迪森股份": "300335", "新文化": "300336", "银邦股份": "300337", "开元股份": "300338", "润和软件": "300339", "科恒股份": "300340", "麦克奥迪": "300341", "天银机电": "300342", "联创股份": "300343", "太空智造": "300344", "华民股份": "300345", "南大光电": "300346", "泰格医药": "300347", "长亮科技": "300348", "金卡智能": "300349", "华鹏飞": "300350", "永贵电器": "300351", "北信源": "300352", "东土科技": "300353", "东华测试": "300354", "蒙草生态": "300355", "光一科技": "300356", "我武生物": "300357", "楚天科技": "300358", "全通教育": "300359", "炬华科技": "300360", "天翔环境": "300362", "博腾股份": "300363", "中文在线": "300364", "恒华科技": "300365", "创意信息": "300366", "东方网力": "300367", "汇金股份": "300368", "绿盟科技": "300369", "安控科技": "300370", "汇中股份": "300371", "扬杰科技": "300373", "中铁装配": "300374", "鹏翎股份": "300375", "易事特": "300376", "赢时胜": "300377", "鼎捷软件": "300378", "东方通": "300379", "安硕信息": "300380", "溢多利": "300381", "斯莱克": "300382", "光环新网": "300383", "三联虹普": "300384", "雪浪环境": "300385", "飞天诚信": "300386", "富邦股份": "300387", "国祯环保": "300388", "艾比森": "300389", "天华超净": "300390", "康跃科技": "300391", "腾信股份": "300392", "中来股份": "300393", "天孚通信": "300394", "菲利华": "300395", "迪瑞医疗": "300396", "天和防务": "300397", "飞凯材料": "300398", "京天利": "300399", "劲拓股份": "300400", "花园生物": "300401", "宝色股份": "300402", "汉宇集团": "300403", "博济医药": "300404", "科隆股份": "300405", "九强生物": "300406", "凯发电气": "300407", "三环集团": "300408", "道氏技术": "300409", "正业科技": "300410", "金盾股份": "300411", "迦南科技": "300412", "芒果超媒": "300413", "中光防雷": "300414", "伊之密": "300415", "苏试试验": "300416", "南华仪器": "300417", "昆仑万维": "300418", "浩丰科技": "300419", "五洋停车": "300420", "力星股份": "300421", "博世科": "300422", "鲁亿通": "300423", "航新科技": "300424", "中建环能": "300425", "唐德影视": "300426", "红相股份": "300427", "四通新材": "300428", "强力新材": "300429", "诚益通": "300430", "暴风集团": "300431", "富临精工": "300432", "蓝思科技": "300433", "金石亚药": "300434", "中泰股份": "300435", "广生堂": "300436", "清水源": "300437", "鹏辉能源": "300438", "美康生物": "300439", "运达科技": "300440", "鲍斯股份": "300441", "普丽盛": "300442", "金雷股份": "300443", "双杰电气": "300444", "康斯特": "300445", "乐凯新材": "300446", "全信股份": "300447", "浩云科技": "300448", "汉邦高科": "300449", "先导智能": "300450", "创业慧康": "300451", "山河药辅": "300452", "三鑫医疗": "300453", "深信服": "300454", "康拓红外": "300455", "赛微电子": "300456", "赢合科技": "300457", "全志科技": "300458", "金科文化": "300459", "惠伦晶体": "300460", "田中精机": "300461", "华铭智能": "300462", "迈克生物": "300463", "星徽精密": "300464", "高伟达": "300465", "赛摩智能": "300466", "迅游科技": "300467", "四方精创": "300468", "信息发展": "300469", "中密控股": "300470", "厚普股份": "300471", "新元科技": "300472", "德尔股份": "300473", "景嘉微": "300474", "聚隆科技": "300475", "胜宏科技": "300476", "合纵科技": "300477", "杭州高新": "300478", "神思电子": "300479", "光力科技": "300480", "濮阳惠成": "300481", "万孚生物": "300482", "沃施股份": "300483", "蓝海华腾": "300484", "赛升药业": "300485", "东杰智能": "300486", "蓝晓科技": "300487", "恒锋工具": "300488", "中飞股份": "300489", "华自科技": "300490", "通合科技": "300491", "华图山鼎": "300492", "润欣科技": "300493", "盛天网络": "300494", "美尚生态": "300495", "中科创达": "300496", "富祥药业": "300497", "温氏股份": "300498", "高澜股份": "300499", "启迪设计": "300500", "海顺新材": "300501", "新易盛": "300502", "昊志机电": "300503", "天邑股份": "300504", "川金诺": "300505", "名家汇": "300506", "苏奥传感": "300507", "维宏股份": "300508", "新美星": "300509", "金冠股份": "300510", "雪榕生物": "300511", "中亚股份": "300512", "恒实科技": "300513", "友讯达": "300514", "三德科技": "300515", "久之洋": "300516", "海波重科": "300517", "盛讯达": "300518", "新光药业": "300519", "科大国创": "300520", "爱司凯": "300521", "世名科技": "300522", "辰安科技": "300523", "博思软件": "300525", "中潜股份": "300526", "中船应急": "300527", "幸福蓝海": "300528", "健帆生物": "300529", "达志科技": "300530", "优博讯": "300531", "今天国际": "300532", "冰川网络": "300533", "陇神戎发": "300534", "达威股份": "300535", "农尚环境": "300536", "广信材料": "300537", "同益股份": "300538", "横河模具": "300539", "深冷股份": "300540", "先进数通": "300541", "新晨科技": "300542", "朗科智能": "300543", "联得装备": "300545", "雄帝科技": "300546", "川环科技": "300547", "博创科技": "300548", "优德精密": "300549", "和仁科技": "300550", "古鳌科技": "300551", "万集科技": "300552", "集智股份": "300553", "三超新材": "300554", "路通视信": "300555", "丝路视觉": "300556", "理工光科": "300557", "贝达药业": "300558", "佳发教育": "300559", "中富通": "300560", "汇金科技": "300561", "乐心医疗": "300562", "神宇股份": "300563", "筑博设计": "300564", "科信技术": "300565", "激智科技": "300566", "精测电子": "300567", "星源材质": "300568", "天能重工": "300569", "太辰光": "300570", "平治信息": "300571", "安车检测": "300572", "兴齐眼药": "300573", "中旗股份": "300575", "容大感光": "300576", "开润股份": "300577", "会畅通讯": "300578", "数字认证": "300579", "贝斯特": "300580", "晨曦航空": "300581", "英飞特": "300582", "赛托生物": "300583", "海辰药业": "300584", "奥联电子": "300585", "美联新材": "300586", "天铁股份": "300587", "熙菱信息": "300588", "江龙船艇": "300589", "移为通信": "300590", "万里马": "300591", "华凯创意": "300592", "新雷能": "300593", "朗进科技": "300594", "欧普康视": "300595", "利安隆": "300596", "吉大通信": "300597", "诚迈科技": "300598", "雄塑科技": "300599", "瑞特股份": "300600", "康泰生物": "300601", "飞荣达": "300602", "立昂技术": "300603", "长川科技": "300604", "恒锋信息": "300605", "金太阳": "300606", "拓斯达": "300607", "思特奇": "300608", "汇纳科技": "300609", "晨化股份": "300610", "美力科技": "300611", "宣亚国际": "300612", "富瀚微": "300613", "欣天科技": "300615", "尚品宅配": "300616", "安靠智电": "300617", "寒锐钴业": "300618", "金银河": "300619", "光库科技": "300620", "维业股份": "300621", "博士眼镜": "300622", "捷捷微电": "300623", "万兴科技": "300624", "三雄极光": "300625", "华瑞股份": "300626", "华测导航": "300627", "亿联网络": "300628", "新劲刚": "300629", "普利制药": "300630", "久吾高科": "300631", "光莆股份": "300632", "开立医疗": "300633", "彩讯股份": "300634", "中达安": "300635", "同和药业": "300636", "扬帆新材": "300637", "广和通": "300638", "凯普生物": "300639", "德艺文创": "300640", "正丹股份": "300641", "透景生命": "300642", "万通智控": "300643", "南京聚隆": "300644", "正元智慧": "300645", "超频三": "300647", "星云股份": "300648", "杭州园林": "300649", "太龙照明": "300650", "金陵体育": "300651", "雷迪克": "300652", "正海生物": "300653", "世纪天鸿": "300654", "晶瑞股份": "300655", "民德电子": "300656", "弘信电子": "300657", "延江股份": "300658", "中孚信息": "300659", "江苏雷利": "300660", "圣邦股份": "300661", "科锐国际": "300662", "科蓝软件": "300663", "鹏鹞环保": "300664", "飞鹿股份": "300665", "江丰电子": "300666", "必创科技": "300667", "杰恩设计": "300668", "沪宁股份": "300669", "大烨智能": "300670", "富满电子": "300671", "国科微": "300672", "佩蒂股份": "300673", "宇信科技": "300674", "建科院": "300675", "华大基因": "300676", "英科医疗": "300677", "中科信息": "300678", "电连技术": "300679", "隆盛科技": "300680", "英搏尔": "300681", "朗新科技": "300682", "海特生物": "300683", "中石科技": "300684", "艾德生物": "300685", "智动力": "300686", "赛意信息": "300687", "创业黑马": "300688", "澄天伟业": "300689", "双一科技": "300690", "联合光电": "300691", "中环环保": "300692", "盛弘股份": "300693", "蠡湖股份": "300694", "兆丰股份": "300695", "爱乐达": "300696", "电工合金": "300697", "万马科技": "300698", "光威复材": "300699", "岱勒新材": "300700", "森霸传感": "300701", "天宇股份": "300702", "创源文化": "300703", "九典制药": "300705", "阿石创": "300706", "威唐工业": "300707", "聚灿光电": "300708", "精研科技": "300709", "万隆光电": "300710", "广哈通信": "300711", "永福股份": "300712", "英可瑞": "300713", "凯伦股份": "300715", "国立科技": "300716", "华信新材": "300717", "长盛轴承": "300718", "安达维尔": "300719", "海川智能": "300720", "怡达股份": "300721", "新余国科": "300722", "一品红": "300723", "捷佳伟创": "300724", "药石科技": "300725", "宏达电子": "300726", "润禾材料": "300727", "乐歌股份": "300729", "科创信息": "300730", "科创新源": "300731", "设研院": "300732", "西菱动力": "300733", "光弘科技": "300735", "百邦科技": "300736", "科顺股份": "300737", "奥飞数据": "300738", "明阳电路": "300739", "御家汇": "300740", "华宝股份": "300741", "越博动力": "300742", "天地数码": "300743", "欣锐科技": "300745", "汉嘉设计": "300746", "锐科激光": "300747", "金力永磁": "300748", "顶固集创": "300749", "宁德时代": "300750", "迈为股份": "300751", "隆利科技": "300752", "爱朋医疗": "300753", "华致酒行": "300755", "中山金马": "300756", "罗博特科": "300757", "七彩化学": "300758", "康龙化成": "300759", "迈瑞医疗": "300760", "立华股份": "300761", "上海瀚讯": "300762", "锦浪科技": "300763", "新诺威": "300765", "每日互动": "300766", "震安科技": "300767", "迪普科技": "300768", "德方纳米": "300769", "新媒股份": "300770", "智莱科技": "300771", "运达股份": "300772", "拉卡拉": "300773", "三角防务": "300775", "帝尔激光": "300776", "中简科技": "300777", "新城市": "300778", "惠城环保": "300779", "德恩精工": "300780", "因赛集团": "300781", "卓胜微": "300782", "三只松鼠": "300783", "值得买": "300785", "国林科技": "300786", "海能实业": "300787", "中信出版": "300788", "唐源电气": "300789", "宇瞳光学": "300790", "仙乐健康": "300791", "壹网壹创": "300792", "佳禾智能": "300793", "米奥会展": "300795", "贝斯美": "300796", "钢研纳克": "300797", "锦鸡股份": "300798", "左江科技": "300799", "力合科技": "300800", "泰和科技": "300801", "矩子科技": "300802", "指南针": "300803", "电声股份": "300805", "斯迪克": "300806", "天迈科技": "300807", "久量股份": "300808", "华辰装备": "300809", "中科海讯": "300810", "铂科新材": "300811", "易天股份": "300812", "泰林生物": "300813", "玉禾田": "300815", "艾可蓝": "300816", "双飞股份": "300817", "耐普矿机": "300818", "聚杰微纤": "300819", "英杰电气": "300820", "东岳硅材": "300821", "贝仕达克": "300822", "建科机械": "300823", "北鼎股份": "300824", "阿尔特": "300825", "测绘股份": "300826", "上能电气": "300827", "锐新科技": "300828", "金丹科技": "300829", "金现代": "300830", "派瑞股份": "300831", "新产业": "300832", "浩洋股份": "300833", "龙磁科技": "300835", "佰奥智能": "300836", "浙矿股份": "300837", "浙江力诺": "300838", "博汇股份": "300839", "酷特智能": "300840", "康华生物": "300841", "帝科股份": "300842", "胜蓝股份": "300843", "捷安高科": "300845", "首都在线": "300846", "中船汉光": "300847", "美瑞新材": "300848", "锦盛新材": "300849", "新强联": "300850", "交大思诺": "300851", "四会富仕": "300852", "申昊科技": "300853", "图南股份": "300855", "科思股份": "300856", "协创数据": "300857", "科拓生物": "300858", "西域旅游": "300859", "锋尚文化": "300860", "美畅股份": "300861", "蓝盾光电": "300862", "卡倍亿": "300863", "南大环境": "300864", "大宏立": "300865", "安克创新": "300866", "圣元环保": "300867", "杰美特": "300868", "康泰医学": "300869", "欧陆通": "300870", "回盛生物": "300871", "天阳科技": "300872", "海晨股份": "300873", "捷强装备": "300875", "蒙泰高新": "300876", "金春股份": "300877", "维康药业": "300878", "浦发银行": "600000", "白云机场": "600004", "东风汽车": "600006", "中国国贸": "600007", "首创股份": "600008", "上海机场": "600009", "包钢股份": "600010", "华能国际": "600011", "皖通高速": "600012", "华夏银行": "600015", "民生银行": "600016", "日照港": "600017", "上港集团": "600018", "宝钢股份": "600019", "中原高速": "600020", "上海电力": "600021", "山东钢铁": "600022", "浙能电力": "600023", "华能水电": "600025", "中远海能": "600026", "华电国际": "600027", "中国石化": "600028", "南方航空": "600029", "中信证券": "600030", "三一重工": "600031", "福建高速": "600033", "楚天高速": "600035", "招商银行": "600036", "歌华有线": "600037", "中直股份": "600038", "四川路桥": "600039", "保利地产": "600048", "中国联通": "600050", "宁波联合": "600051", "浙江广厦": "600052", "九鼎投资": "600053", "黄山旅游": "600054", "万东医疗": "600055", "中国医药": "600056", "厦门象屿": "600057", "五矿发展": "600058", "古越龙山": "600059", "海信视像": "600060", "国投资本": "600061", "华润双鹤": "600062", "皖维高新": "600063", "南京高科": "600064", "宇通客车": "600066", "冠城大通": "600067", "葛洲坝": "600068", "退市银鸽": "600069", "浙江富润": "600070", "凤凰光学": "600071", "中船科技": "600072", "上海梅林": "600073", "新疆天业": "600075", "康欣新材": "600076", "宋都股份": "600077", "澄星股份": "600078", "人福医药": "600079", "ST金花": "600080", "东风科技": "600081", "海泰发展": "600082", "*ST博信": "600083", "ST中葡": "600084", "同仁堂": "600085", "*ST金钰": "600086", "中视传媒": "600088", "特变电工": "600089", "*ST济堂": "600090", "ST明科": "600091", "易见股份": "600093", "大名城": "600094", "哈高科": "600095", "云天化": "600096", "开创国际": "600097", "广州发展": "600098", "林海股份": "600099", "同方股份": "600100", "明星电力": "600101", "青山纸业": "600103", "上汽集团": "600104", "永鼎股份": "600105", "重庆路桥": "600106", "美尔雅": "600107", "亚盛集团": "600108", "国金证券": "600109", "诺德股份": "600110", "北方稀土": "600111", "ST天成": "600112", "浙江东日": "600113", "东睦股份": "600114", "东方航空": "600115", "三峡水利": "600116", "西宁特钢": "600117", "中国卫星": "600118", "ST长投": "600119", "浙江东方": "600120", "郑州煤电": "600121", "*ST宏图": "600122", "兰花科创": "600123", "铁龙物流": "600125", "杭钢股份": "600126", "金健米业": "600127", "弘业股份": "600128", "太极集团": "600129", "波导股份": "600130", "国网信通": "600131", "重庆啤酒": "600132", "东湖高新": "600133", "乐凯胶片": "600135", "当代文体": "600136", "浪莎股份": "600137", "中青旅": "600138", "西部资源": "600139", "兴发集团": "600141", "金发科技": "600143", "*ST新亿": "600145", "*ST环球": "600146", "长春一东": "600148", "ST坊展": "600149", "中国船舶": "600150", "航天机电": "600151", "维科技术": "600152", "建发股份": "600153", "华创阳安": "600155", "华升股份": "600156", "永泰能源": "600157", "中体产业": "600158", "大龙地产": "600159", "巨化股份": "600160", "天坛生物": "600161", "香江控股": "600162", "中闽能源": "600163", "新日恒力": "600165", "福田汽车": "600166", "联美控股": "600167", "武汉控股": "600168", "太原重工": "600169", "上海建工": "600170", "上海贝岭": "600171", "黄河旋风": "600172", "卧龙地产": "600173", "中国巨石": "600176", "雅戈尔": "600177", "东安动力": "600178", "*ST安通": "600179", "瑞茂通": "600180", "S佳通": "600182", "生益科技": "600183", "光电股份": "600184", "格力地产": "600185", "莲花健康": "600186", "国中水务": "600187", "兖州煤业": "600188", "吉林森工": "600189", "锦州港": "600190", "华资实业": "600191", "长城电工": "600192", "ST创兴": "600193", "中牧股份": "600195", "复星医药": "600196", "伊力特": "600197", "大唐电信": "600198", "金种子酒": "600199", "江苏吴中": "600200", "生物股份": "600201", "哈空调": "600202", "福日电子": "600203", "有研新材": "600206", "安彩高科": "600207", "新湖中宝": "600208", "ST罗顿": "600209", "紫江企业": "600210", "西藏药业": "600211", "*ST江泉": "600212", "亚星客车": "600213", "*ST经开": "600215", "浙江医药": "600216", "中再资环": "600217", "全柴动力": "600218", "南山铝业": "600219", "江苏阳光": "600220", "海航控股": "600221", "太龙药业": "600222", "鲁商发展": "600223", "*ST松江": "600225", "*ST瀚叶": "600226", "圣济堂": "600227", "ST昌九": "600228", "城市传媒": "600229", "沧州大化": "600230", "凌钢股份": "600231", "金鹰股份": "600232", "圆通速递": "600233", "ST山水": "600234", "民丰特纸": "600235", "桂冠电力": "600236", "铜峰电子": "600237", "ST椰岛": "600238", "云南城投": "600239", "*ST时万": "600241", "*ST中昌": "600242", "*ST海华": "600243", "万通发展": "600246", "*ST成城": "600247", "延长化建": "600248", "两面针": "600249", "南纺股份": "600250", "冠农股份": "600251", "中恒集团": "600252", "*ST梦舟": "600255", "广汇能源": "600256", "大湖股份": "600257", "首旅酒店": "600258", "广晟有色": "600259", "凯乐科技": "600260", "阳光照明": "600261", "北方股份": "600262", "ST景谷": "600265", "城建发展": "600266", "海正药业": "600267", "国电南自": "600268", "赣粤高速": "600269", "航天信息": "600271", "开开实业": "600272", "嘉化能源": "600273", "ST昌鱼": "600275", "恒瑞医药": "600276", "亿利洁能": "600277", "东方创业": "600278", "重庆港九": "600279", "*ST中商": "600280", "太化股份": "600281", "南钢股份": "600282", "钱江水利": "600283", "浦东建设": "600284", "羚锐制药": "600285", "江苏舜天": "600287", "大恒科技": "600288", "*ST信通": "600289", "*ST华仪": "600290", "西水股份": "600291", "远达环保": "600292", "三峡新材": "600293", "鄂尔多斯": "600295", "广汇汽车": "600297", "安琪酵母": "600298", "安迪苏": "600299", "维维股份": "600300", "ST南化": "600301", "标准股份": "600302", "曙光股份": "600303", "恒顺醋业": "600305", "*ST商城": "600306", "酒钢宏兴": "600307", "华泰股份": "600308", "万华化学": "600309", "桂东电力": "600310", "*ST荣华": "600311", "平高电气": "600312", "农发种业": "600313", "上海家化": "600315", "洪都航空": "600316", "营口港": "600317", "新力金融": "600318", "ST亚星": "600319", "振华重工": "600320", "正源股份": "600321", "天房发展": "600322", "瀚蓝环境": "600323", "华发股份": "600325", "西藏天路": "600326", "大东方": "600327", "中盐化工": "600328", "中新药业": "600329", "天通股份": "600330", "宏达股份": "600331", "白云山": "600332", "长春燃气": "600333", "国机汽车": "600335", "澳柯玛": "600336", "美克家居": "600337", "西藏珠峰": "600338", "中油工程": "600339", "华夏幸福": "600340", "航天动力": "600343", "长江通信": "600345", "恒力石化": "600346", "阳泉煤业": "600348", "山东高速": "600350", "亚宝药业": "600351", "浙江龙盛": "600352", "旭光电子": "600353", "*ST敦种": "600354", "精伦电子": "600355", "恒丰纸业": "600356", "*ST联合": "600358", "新农开发": "600359", "华微电子": "600360", "华联综超": "600361", "江西铜业": "600362", "联创光电": "600363", "ST通葡": "600365", "宁波韵升": "600366", "红星发展": "600367", "五洲交通": "600368", "西南证券": "600369", "三房巷": "600370", "万向德农": "600371", "中航电子": "600372", "中文传媒": "600373", "华菱星马": "600375", "首开股份": "600376", "宁沪高速": "600377", "昊华科技": "600378", "宝光股份": "600379", "健康元": "600380", "青海春天": "600381", "广东明珠": "600382", "金地集团": "600383", "ST金泰": "600385", "北巴传媒": "600386", "海越能源": "600387", "龙净环保": "600388", "江山股份": "600389", "五矿资本": "600390", "航发科技": "600391", "盛和资源": "600392", "粤泰股份": "600393", "盘江股份": "600395", "金山股份": "600396", "安源煤业": "600397", "海澜之家": "600398", "ST抚钢": "600399", "红豆股份": "600400", "大有能源": "600403", "动力源": "600405", "国电南瑞": "600406", "ST安泰": "600408", "三友化工": "600409", "华胜天成": "600410", "小商品城": "600415", "*ST湘电": "600416", "江淮汽车": "600418", "天润乳业": "600419", "现代制药": "600420", "ST仰帆": "600421", "昆药集团": "600422", "ST柳化": "600423", "青松建化": "600425", "华鲁恒升": "600426", "中远海特": "600428", "三元股份": "600429", "冠豪高新": "600433", "北方导航": "600435", "片仔癀": "600436", "通威股份": "600438", "瑞贝卡": "600439", "国机通用": "600444", "金证股份": "600446", "华纺股份": "600448", "宁夏建材": "600449", "涪陵电力": "600452", "博通股份": "600455", "宝钛股份": "600456", "时代新材": "600458", "贵研铂业": "600459", "士兰微": "600460", "洪城水业": "600461", "*ST九有": "600462", "空港股份": "600463", "蓝光发展": "600466", "好当家": "600467", "百利电气": "600468", "风神股份": "600469", "*ST六化": "600470", "华光环能": "600475", "湘邮科技": "600476", "杭萧钢构": "600477", "科力远": "600478", "千金药业": "600479", "凌云股份": "600480", "双良节能": "600481", "中国动力": "600482", "福能股份": "600483", "*ST信威": "600485", "扬农化工": "600486", "亨通光电": "600487", "天药股份": "600488", "中金黄金": "600489", "鹏欣资源": "600490", "龙元建设": "600491", "凤竹纺织": "600493", "晋西车轴": "600495", "精工钢构": "600496", "驰宏锌锗": "600497", "烽火通信": "600498", "科达制造": "600499", "中化国际": "600500", "航天晨光": "600501", "安徽建工": "600502", "华丽家族": "600503", "西昌电力": "600505", "香梨股份": "600506", "方大特钢": "600507", "上海能源": "600508", "天富能源": "600509", "黑牡丹": "600510", "国药股份": "600511", "腾达建设": "600512", "联环药业": "600513", "海航基础": "600515", "方大炭素": "600516", "国网英大": "600517", "ST康美": "600518", "贵州茅台": "600519", "文一科技": "600520", "华海药业": "600521", "中天科技": "600522", "贵航股份": "600523", "长园集团": "600525", "菲达环保": "600526", "江南高纤": "600527", "中铁工业": "600528", "山东药玻": "600529", "*ST交昂": "600530", "豫光金铅": "600531", "宏达矿业": "600532", "栖霞建设": "600533", "天士力": "600535", "中国软件": "600536", "亿晶光电": "600537", "国发股份": "600538", "ST狮头": "600539", "新赛股份": "600540", "莫高股份": "600543", "卓郎智能": "600545", "山煤国际": "600546", "山东黄金": "600547", "深高速": "600548", "厦门钨业": "600549", "保变电气": "600550", "时代出版": "600551", "凯盛科技": "600552", "*ST海创": "600555", "天下秀": "600556", "康缘药业": "600557", "大西洋": "600558", "老白干酒": "600559", "金自天正": "600560", "江西长运": "600561", "国睿科技": "600562", "法拉电子": "600563", "迪马股份": "600565", "济川药业": "600566", "山鹰纸业": "600567", "*ST中珠": "600568", "安阳钢铁": "600569", "恒生电子": "600570", "信雅达": "600571", "康恩贝": "600572", "惠泉啤酒": "600573", "淮河能源": "600575", "祥源文化": "600576", "精达股份": "600577", "京能电力": "600578", "克劳斯": "600579", "卧龙电驱": "600580", "八一钢铁": "600581", "天地科技": "600582", "海油工程": "600583", "长电科技": "600584", "海螺水泥": "600585", "金晶科技": "600586", "新华医疗": "600587", "用友网络": "600588", "广东榕泰": "600589", "泰豪科技": "600590", "龙溪股份": "600592", "大连圣亚": "600593", "益佰制药": "600594", "ST中孚": "600595", "新安股份": "600596", "光明乳业": "600597", "北大荒": "600598", "*ST熊猫": "600599", "青岛啤酒": "600600", "方正科技": "600601", "云赛智联": "600602", "广汇物流": "600603", "市北高新": "600604", "汇通能源": "600605", "绿地控股": "600606", "ST沪科": "600608", "金杯汽车": "600609", "ST毅达": "600610", "大众交通": "600611", "老凤祥": "600612", "神奇制药": "600613", "*ST鹏起": "600614", "丰华股份": "600615", "金枫酒业": "600616", "国新能源": "600617", "氯碱化工": "600618", "海立股份": "600619", "天宸股份": "600620", "华鑫股份": "600621", "光大嘉宝": "600622", "华谊集团": "600623", "复旦复华": "600624", "申达股份": "600626", "新世界": "600628", "华建集团": "600629", "龙头股份": "600630", "浙数文化": "600633", "*ST富控": "600634", "大众公用": "600635", "国新文化": "600636", "东方明珠": "600637", "新黄浦": "600638", "浦东金桥": "600639", "号百控股": "600640", "万业企业": "600641", "申能股份": "600642", "爱建集团": "600643", "乐山电力": "600644", "中源协和": "600645", "同达创业": "600647", "外高桥": "600648", "城投控股": "600649", "锦江投资": "600650", "*ST飞乐": "600651", "ST游久": "600652", "申华控股": "600653", "ST中安": "600654", "豫园股份": "600655", "信达地产": "600657", "电子城": "600658", "福耀玻璃": "600660", "昂立教育": "600661", "强生控股": "600662", "陆家嘴": "600663", "哈药股份": "600664", "天地源": "600665", "ST瑞德": "600666", "太极实业": "600667", "尖峰集团": "600668", "*ST目药": "600671", "东阳光": "600673", "川投能源": "600674", "中华企业": "600675", "交运股份": "600676", "*ST航通": "600677", "四川金顶": "600678", "上海凤凰": "600679", "百川能源": "600681", "南京新百": "600682", "京投发展": "600683", "珠江实业": "600684", "中船防务": "600685", "金龙汽车": "600686", "*ST刚泰": "600687", "上海石化": "600688", "上海三毛": "600689", "海尔智家": "600690", "阳煤化工": "600691", "亚通股份": "600692", "东百集团": "600693", "大商股份": "600694", "绿庭投资": "600695", "ST岩石": "600696", "欧亚集团": "600697", "ST天雁": "600698", "均胜电子": "600699", "*ST工新": "600701", "舍得酒业": "600702", "三安光电": "600703", "物产中大": "600704", "中航资本": "600705", "曲江文旅": "600706", "彩虹股份": "600707", "光明地产": "600708", "苏美达": "600710", "盛屯矿业": "600711", "南宁百货": "600712", "南京医药": "600713", "金瑞矿业": "600714", "文投控股": "600715", "凤凰股份": "600716", "天津港": "600717", "东软集团": "600718", "大连热电": "600719", "祁连山": "600720", "ST百花": "600721", "金牛化工": "600722", "首商股份": "600723", "宁波富达": "600724", "ST云维": "600725", "华电能源": "600726", "鲁北化工": "600727", "佳都科技": "600728", "重庆百货": "600729", "中国高科": "600730", "湖南海利": "600731", "爱旭股份": "600732", "北汽蓝谷": "600733", "*ST实达": "600734", "新华锦": "600735", "苏州高新": "600736", "中粮糖业": "600737", "兰州民百": "600738", "辽宁成大": "600739", "山西焦化": "600740", "华域汽车": "600741", "一汽富维": "600742", "华远地产": "600743", "华银电力": "600744", "闻泰科技": "600745", "江苏索普": "600746", "上实发展": "600748", "西藏旅游": "600749", "江中药业": "600750", "海航科技": "600751", "东方银星": "600753", "锦江酒店": "600754", "厦门国贸": "600755", "浪潮软件": "600756", "长江传媒": "600757", "辽宁能源": "600758", "洲际油气": "600759", "中航沈飞": "600760", "安徽合力": "600761", "通策医疗": "600763", "中国海防": "600764", "中航重机": "600765", "园城黄金": "600766", "ST运盛": "600767", "宁波富邦": "600768", "祥龙电业": "600769", "综艺股份": "600770", "广誉远": "600771", "西藏城投": "600773", "汉商集团": "600774", "南京熊猫": "600775", "东方通信": "600776", "新潮能源": "600777", "友好集团": "600778", "水井坊": "600779", "通宝能源": "600780", "*ST辅仁": "600781", "新钢股份": "600782", "鲁信创投": "600783", "鲁银投资": "600784", "新华百货": "600785", "中储股份": "600787", "鲁抗医药": "600789", "轻纺城": "600790", "京能置业": "600791", "云煤能源": "600792", "宜宾纸业": "600793", "保税科技": "600794", "国电电力": "600795", "钱江生化": "600796", "浙大网新": "600797", "宁波海运": "600798", "天津磁卡": "600800", "华新水泥": "600801", "福建水泥": "600802", "新奥股份": "600803", "鹏博士": "600804", "悦达投资": "600805", "济南高新": "600807", "马钢股份": "600808", "山西汾酒": "600809", "神马股份": "600810", "东方集团": "600811", "华北制药": "600812", "杭州解百": "600814", "*ST厦工": "600815", "*ST安信": "600816", "ST宏盛": "600817", "中路股份": "600818", "耀皮玻璃": "600819", "隧道股份": "600820", "*ST劝业": "600821", "上海物贸": "600822", "世茂股份": "600823", "益民集团": "600824", "新华传媒": "600825", "兰生股份": "600826", "百联股份": "600827", "茂业商业": "600828", "人民同泰": "600829", "香溢融通": "600830", "广电网络": "600831", "第一医药": "600833", "申通地铁": "600834", "上海机电": "600835", "*ST界龙": "600836", "海通证券": "600837", "上海九百": "600838", "四川长虹": "600839", "上柴股份": "600841", "上工申贝": "600843", "丹化科技": "600844", "宝信软件": "600845", "同济科技": "600846", "万里股份": "600847", "上海临港": "600848", "华东电脑": "600850", "海欣股份": "600851", "龙建股份": "600853", "春兰股份": "600854", "航天长峰": "600855", "*ST中天": "600856", "宁波中百": "600857", "银座股份": "600858", "王府井": "600859", "*ST京城": "600860", "北京城乡": "600861", "中航高科": "600862", "内蒙华电": "600863", "哈投股份": "600864", "百大集团": "600865", "星湖科技": "600866", "通化东宝": "600867", "梅雁吉祥": "600868", "智慧能源": "600869", "ST厦华": "600870", "石化油服": "600871", "中炬高新": "600872", "梅花生物": "600873", "创业环保": "600874", "东方电气": "600875", "洛阳玻璃": "600876", "ST电能": "600877", "航天电子": "600879", "博瑞传播": "600880", "亚泰集团": "600881", "妙可蓝多": "600882", "博闻科技": "600883", "杉杉股份": "600884", "宏发股份": "600885", "国投电力": "600886", "伊利股份": "600887", "新疆众和": "600888", "南京化纤": "600889", "中房股份": "600890", "*ST秋林": "600891", "*ST大晟": "600892", "航发动力": "600893", "广日股份": "600894", "张江高科": "600895", "览海医疗": "600896", "厦门空港": "600897", "*ST美讯": "600898", "长江电力": "600900", "江苏租赁": "600901", "贵州燃气": "600903", "无锡银行": "600908", "华安证券": "600909", "重庆燃气": "600917", "中泰证券": "600918", "江苏银行": "600919", "杭州银行": "600926", "西安银行": "600928", "湖南盐业": "600929", "爱柯迪": "600933", "广西广电": "600936", "重庆建工": "600939", "新天绿能": "600956", "东方证券": "600958", "江苏有线": "600959", "渤海汽车": "600960", "株冶集团": "600961", "国投中鲁": "600962", "岳阳林纸": "600963", "福成股份": "600965", "博汇纸业": "600966", "内蒙一机": "600967", "海油发展": "600968", "郴电国际": "600969", "中材国际": "600970", "恒源煤电": "600971", "宝胜股份": "600973", "新五丰": "600975", "健民集团": "600976", "中国电影": "600977", "*ST宜生": "600978", "广安爱众": "600979", "北矿科技": "600980", "汇鸿集团": "600981", "宁波热电": "600982", "惠而浦": "600983", "建设机械": "600984", "淮北矿业": "600985", "科达股份": "600986", "航民股份": "600987", "赤峰黄金": "600988", "宝丰能源": "600989", "四创电子": "600990", "贵绳股份": "600992", "马应龙": "600993", "文山电力": "600995", "贵广网络": "600996", "开滦股份": "600997", "九州通": "600998", "招商证券": "600999", "唐山港": "601000", "大同煤业": "601001", "晋亿实业": "601002", "柳钢股份": "601003", "重庆钢铁": "601005", "大秦铁路": "601006", "金陵饭店": "601007", "连云港": "601008", "南京银行": "601009", "文峰股份": "601010", "宝泰隆": "601011", "隆基股份": "601012", "陕西黑猫": "601015", "节能风电": "601016", "宁波港": "601018", "山东出版": "601019", "华钰矿业": "601020", "春秋航空": "601021", "玉龙股份": "601028", "一拖股份": "601038", "赛轮轮胎": "601058", "中信建投": "601066", "中铝国际": "601068", "西部黄金": "601069", "渝农商行": "601077", "国芳集团": "601086", "中国神华": "601088", "中南传媒": "601098", "太平洋": "601099", "恒立液压": "601100", "昊华能源": "601101", "中国一重": "601106", "四川成渝": "601107", "财通证券": "601108", "中国国航": "601111", "ST华鼎": "601113", "三江购物": "601116", "中国化学": "601117", "海南橡胶": "601118", "四方股份": "601126", "小康股份": "601127", "常熟银行": "601128", "博威合金": "601137", "工业富联": "601138", "深圳燃气": "601139", "新城控股": "601155", "重庆水务": "601158", "天风证券": "601162", "三角轮胎": "601163", "兴业银行": "601166", "西部矿业": "601168", "北京银行": "601169", "杭齿前进": "601177", "中国西电": "601179", "中国铁建": "601186", "龙江交通": "601188", "东兴证券": "601198", "江南水务": "601199", "上海环境": "601200", "东材科技": "601208", "国泰君安": "601211", "白银有色": "601212", "君正集团": "601216", "吉鑫科技": "601218", "林洋能源": "601222", "陕西煤业": "601225", "华电重工": "601226", "广州港": "601228", "上海银行": "601229", "环旭电子": "601231", "桐昆股份": "601233", "红塔证券": "601236", "广汽集团": "601238", "ST庞大": "601258", "农业银行": "601288", "青岛港": "601298", "骆驼股份": "601311", "中国平安": "601318", "中国人保": "601319", "秦港股份": "601326", "交通银行": "601328", "绿色动力": "601330", "广深铁路": "601333", "新华保险": "601336", "百隆东方": "601339", "三六零": "601360", "利群股份": "601366", "绿城水务": "601368", "陕鼓动力": "601369", "中原证券": "601375", "兴业证券": "601377", "怡球资源": "601388", "中国中铁": "601390", "工商银行": "601398", "ST国重装": "601399", "国联证券": "601456", "通用股份": "601500", "中新集团": "601512", "东风股份": "601515", "吉林高速": "601518", "大智慧": "601519", "东吴证券": "601555", "九牧王": "601566", "三星医疗": "601567", "长沙银行": "601577", "会稽山": "601579", "北辰实业": "601588", "上海电影": "601595", "中国外运": "601598", "鹿港文化": "601599", "中国铝业": "601600", "中国太保": "601601", "长城军工": "601606", "上海医药": "601607", "中信重工": "601608", "金田铜业": "601609", "中国核建": "601611", "明阳智能": "601615", "广电电气": "601616", "中国中冶": "601618", "嘉泽新能": "601619", "中国人寿": "601628", "长城汽车": "601633", "旗滨集团": "601636", "邮储银行": "601658", "平煤股份": "601666", "中国建筑": "601668", "中国电建": "601669", "明泰铝业": "601677", "滨化股份": "601678", "华泰证券": "601688", "拓普集团": "601689", "中银证券": "601696", "中国卫通": "601698", "潞安环能": "601699", "风范股份": "601700", "郑煤机": "601717", "际华集团": "601718", "上海电气": "601727", "中国中车": "601766", "*ST力帆": "601777", "晶科科技": "601778", "光大证券": "601788", "宁波建工": "601789", "蓝科高新": "601798", "星宇股份": "601799", "中国交建": "601800", "皖新传媒": "601801", "中海油服": "601808", "新华文轩": "601811", "京沪高铁": "601816", "光大银行": "601818", "三峰环境": "601827", "美凯龙": "601828", "成都银行": "601838", "中国石油": "601857", "中国科传": "601858", "紫金银行": "601860", "福莱特": "601865", "中远海发": "601866", "长飞光纤": "601869", "招商轮船": "601872", "正泰电器": "601877", "浙商证券": "601878", "大连港": "601880", "中国银河": "601881", "海天精工": "601882", "江河集团": "601886", "中国中免": "601888", "亚星锚链": "601890", "中煤能源": "601898", "紫金矿业": "601899", "南方传媒": "601900", "方正证券": "601901", "京运通": "601908", "浙商银行": "601916", "新集能源": "601918", "中远海控": "601919", "凤凰传媒": "601928", "吉视传媒": "601929", "永辉超市": "601933", "建设银行": "601939", "中国出版": "601949", "苏垦农发": "601952", "金钼股份": "601958", "中国汽研": "601965", "玲珑轮胎": "601966", "宝钢包装": "601968", "海南矿业": "601969", "招商南油": "601975", "中国核电": "601985", "中国银行": "601988", "中国重工": "601989", "南京证券": "601990", "大唐发电": "601991", "金隅集团": "601992", "丰林集团": "601996", "贵阳银行": "601997", "中信银行": "601998", "出版传媒": "601999", "人民网": "603000", "奥康国际": "603001", "宏昌电子": "603002", "龙宇燃油": "603003", "晶方科技": "603005", "联明股份": "603006", "花王股份": "603007", "喜临门": "603008", "北特科技": "603009", "万盛股份": "603010", "合锻智能": "603011", "创力集团": "603012", "亚普股份": "603013", "弘讯科技": "603015", "新宏泰": "603016", "中衡设计": "603017", "中设集团": "603018", "中科曙光": "603019", "爱普股份": "603020", "山东华鹏": "603021", "新通联": "603022", "威帝股份": "603023", "大豪科技": "603025", "石大胜华": "603026", "千禾味业": "603027", "赛福天": "603028", "天鹅股份": "603029", "全筑股份": "603030", "安德利": "603031", "德新交运": "603032", "三维股份": "603033", "常熟汽饰": "603035", "如通股份": "603036", "凯众股份": "603037", "华立股份": "603038", "泛微网络": "603039", "新坐标": "603040", "美思德": "603041", "华脉科技": "603042", "广州酒家": "603043", "福达合金": "603045", "科林电气": "603050", "成都燃气": "603053", "台华新材": "603055", "德邦股份": "603056", "永吉股份": "603058", "倍加洁": "603059", "国检集团": "603060", "禾望电气": "603063", "音飞储存": "603066", "振华股份": "603067", "博通集成": "603068", "海汽集团": "603069", "乐惠国际": "603076", "和邦生物": "603077", "江化微": "603078", "圣达生物": "603079", "新疆火炬": "603080", "大丰实业": "603081", "剑桥科技": "603083", "天成自控": "603085", "先达股份": "603086", "甘李药业": "603087", "宁波精达": "603088", "正裕工业": "603089", "宏盛股份": "603090", "南华期货": "603093", "越剑智能": "603095", "新经典": "603096", "森特股份": "603098", "长白山": "603099", "川仪股份": "603100", "汇嘉时代": "603101", "横店影视": "603103", "芯能科技": "603105", "恒银科技": "603106", "润达医疗": "603108", "神驰机电": "603109", "东方材料": "603110", "康尼机电": "603111", "金能科技": "603113", "海星股份": "603115", "红蜻蜓": "603116", "万林物流": "603117", "共进股份": "603118", "华培动力": "603121", "翠微股份": "603123", "中材节能": "603126", "昭衍新药": "603127", "华贸物流": "603128", "春风动力": "603129", "上海沪工": "603131", "碳元科技": "603133", "天目湖": "603136", "海量数据": "603138", "康惠制药": "603139", "养元饮品": "603156", "*ST拉夏": "603157", "腾龙股份": "603158", "上海亚虹": "603159", "汇顶科技": "603160", "科华控股": "603161", "荣晟环保": "603165", "福达股份": "603166", "渤海轮渡": "603167", "莎普爱思": "603168", "兰石重装": "603169", "德创环保": "603177", "圣龙股份": "603178", "新泉股份": "603179", "金牌厨柜": "603180", "皇马科技": "603181", "建研院": "603183", "上机数控": "603185", "华正新材": "603186", "海容冷链": "603187", "ST亚邦": "603188", "网达软件": "603189", "汇得科技": "603192", "公牛集团": "603195", "日播时尚": "603196", "保隆科技": "603197", "迎驾贡酒": "603198", "九华旅游": "603199", "上海洗霸": "603200", "快克股份": "603203", "江山欧派": "603208", "赛伍技术": "603212", "爱婴室": "603214", "元利科技": "603217", "日月股份": "603218", "中贝通信": "603220", "爱丽家居": "603221", "济民制药": "603222", "恒通股份": "603223", "新凤鸣": "603225", "菲林格尔": "603226", "雪峰科技": "603227", "景旺电子": "603228", "奥翔药业": "603229", "格尔软件": "603232", "大参林": "603233", "移远通信": "603236", "诺邦股份": "603238", "浙江仙通": "603239", "宏和科技": "603256", "电魂网络": "603258", "药明康德": "603259", "合盛硅业": "603260", "天龙股份": "603266", "鸿远电子": "603267", "松发股份": "603268", "海鸥股份": "603269", "银都股份": "603277", "大业股份": "603278", "景津环保": "603279", "赛腾股份": "603283", "日盈电子": "603286", "海天味业": "603288", "泰瑞机器": "603289", "斯达半导": "603290", "永新光学": "603297", "杭叉集团": "603298", "苏盐井神": "603299", "华铁应急": "603300", "振德医疗": "603301", "得邦照明": "603303", "旭升股份": "603305", "华懋科技": "603306", "应流股份": "603308", "维力医疗": "603309", "金海环境": "603311", "梦百合": "603313", "福鞍股份": "603315", "诚邦股份": "603316", "天味食品": "603317", "派思股份": "603318", "湘油泵": "603319", "迪贝电气": "603320", "梅轮电梯": "603321", "超讯通信": "603322", "苏农银行": "603323", "我乐家居": "603326", "福蓉科技": "603327", "依顿电子": "603328", "上海雅仕": "603329", "上海天洋": "603330", "百达精工": "603331", "苏州龙杰": "603332", "尚纬股份": "603333", "迪生力": "603335", "宏辉果蔬": "603336", "杰克股份": "603337", "浙江鼎力": "603338", "四方科技": "603339", "安井食品": "603345", "文灿股份": "603348", "威尔药业": "603351", "和顺石油": "603353", "莱克电气": "603355", "华菱精工": "603356", "设计总院": "603357", "华达科技": "603358", "东珠生态": "603359", "百傲化学": "603360", "傲农生物": "603363", "水星家纺": "603365", "日出东方": "603366", "辰欣药业": "603367", "柳药股份": "603368", "今世缘": "603369", "东方时尚": "603377", "亚士创能": "603378", "三美股份": "603379", "易德龙": "603380", "顶点软件": "603383", "惠达卫浴": "603385", "广东骏亚": "603386", "基蛋生物": "603387", "元成股份": "603388", "*ST亚振": "603389", "通达电气": "603390", "万泰生物": "603392", "新天然气": "603393", "金辰股份": "603396", "邦宝益智": "603398", "吉翔股份": "603399", "建霖家居": "603408", "信捷电气": "603416", "鼎信通讯": "603421", "集友股份": "603429", "贵州三力": "603439", "吉比特": "603444", "九洲药业": "603456", "勘设股份": "603458", "风语筑": "603466", "振静股份": "603477", "科沃斯": "603486", "展鹏科技": "603488", "八方股份": "603489", "恒为科技": "603496", "翔港科技": "603499", "祥和实业": "603500", "韦尔股份": "603501", "金石资源": "603505", "南都物业": "603506", "振江股份": "603507", "思维列控": "603508", "欧普照明": "603515", "淳中科技": "603516", "绝味食品": "603517", "锦泓集团": "603518", "立霸股份": "603519", "司太立": "603520", "众源新材": "603527", "多伦科技": "603528", "神马电力": "603530", "掌阅科技": "603533", "嘉诚国际": "603535", "惠发食品": "603536", "美诺华": "603538", "奥普家居": "603551", "*ST贵人": "603555", "海兴电力": "603556", "起步股份": "603557", "健盛集团": "603558", "中通国脉": "603559", "普莱柯": "603566", "珍宝岛": "603567", "伟明环保": "603568", "长久物流": "603569", "汇金通": "603577", "三星新材": "603578", "荣泰健康": "603579", "艾艾精工": "603580", "捷昌驱动": "603583", "苏利股份": "603585", "金麒麟": "603586", "地素时尚": "603587", "高能环境": "603588", "口子窖": "603589", "康辰药业": "603590", "东尼电子": "603595", "伯特利": "603596", "引力传媒": "603598", "广信股份": "603599", "永艺股份": "603600", "再升科技": "603601", "纵横通信": "603602", "博天环境": "603603", "珀莱雅": "603605", "东方电缆": "603606", "京华激光": "603607", "天创时尚": "603608", "禾丰牧业": "603609", "麒盛科技": "603610", "诺力股份": "603611", "索通发展": "603612", "国联股份": "603613", "茶花股份": "603615", "韩建河山": "603616", "君禾股份": "603617", "杭电股份": "603618", "中曼石油": "603619", "科森科技": "603626", "清源股份": "603628", "利通电子": "603629", "拉芳家化": "603630", "徕木股份": "603633", "南威软件": "603636", "镇海股份": "603637", "艾迪精密": "603638", "海利尔": "603639", "畅联股份": "603648", "彤程新材": "603650", "朗博科技": "603655", "泰禾光电": "603656", "春光科技": "603657", "安图生物": "603658", "璞泰来": "603659", "苏州科达": "603660", "恒林股份": "603661", "柯力传感": "603662", "三祥新材": "603663", "康隆达": "603665", "亿嘉和": "603666", "五洲新春": "603667", "天马科技": "603668", "灵康药业": "603669", "卫信康": "603676", "奇精机械": "603677", "火炬电子": "603678", "华体科技": "603679", "今创集团": "603680", "永冠新材": "603681", "锦和商业": "603682", "晶华新材": "603683", "晨丰科技": "603685", "龙马环卫": "603686", "大胜达": "603687", "石英股份": "603688", "皖天然气": "603689", "至纯科技": "603690", "江苏新能": "603693", "安记食品": "603696", "有友食品": "603697", "航天工程": "603698", "纽威股份": "603699", "宁水集团": "603700", "德宏股份": "603701", "盛洋科技": "603703", "东方环宇": "603706", "健友股份": "603707", "家家悦": "603708", "中源家居": "603709", "香飘飘": "603711", "七一二": "603712", "密尔克卫": "603713", "塞力斯": "603716", "天域生态": "603717", "海利生物": "603718", "良品铺子": "603719", "中广天择": "603721", "阿科力": "603722", "天安新材": "603725", "朗迪集团": "603726", "博迈科": "603727", "鸣志电器": "603728", "龙韵股份": "603729", "岱美股份": "603730", "仙鹤股份": "603733", "三棵树": "603737", "泰晶科技": "603738", "蔚蓝生物": "603739", "日辰股份": "603755", "大元泵业": "603757", "秦安股份": "603758", "隆鑫通用": "603766", "中马传动": "603767", "常青股份": "603768", "沃格光电": "603773", "永安行": "603776", "来伊份": "603777", "乾景园林": "603778", "ST威龙": "603779", "科博达": "603786", "新日股份": "603787", "宁波高发": "603788", "星光农机": "603789", "雅运股份": "603790", "联泰环保": "603797", "康普顿": "603798", "华友钴业": "603799", "道森股份": "603800", "志邦家居": "603801", "瑞斯康达": "603803", "福斯特": "603806", "歌力思": "603808", "豪能股份": "603809", "丰山集团": "603810", "诚意药业": "603811", "原尚股份": "603813", "交建股份": "603815", "顾家家居": "603816", "海峡环保": "603817", "曲美家居": "603818", "神力股份": "603819", "嘉澳环保": "603822", "百合花": "603823", "华扬联众": "603825", "坤彩科技": "603826", "柯利达": "603828", "洛凯股份": "603829", "欧派家居": "603833", "四通股份": "603838", "安正时尚": "603839", "正平股份": "603843", "好太太": "603848", "华荣股份": "603855", "东宏股份": "603856", "步长制药": "603858", "能科股份": "603859", "中公高科": "603860", "白云电器": "603861", "松炀资源": "603863", "桃李面包": "603866", "新化股份": "603867", "飞科电器": "603868", "新智认知": "603869", "嘉友国际": "603871", "鼎胜新材": "603876", "太平鸟": "603877", "武进不锈": "603878", "永悦科技": "603879", "南卫股份": "603880", "数据港": "603881", "金域医学": "603882", "老百姓": "603883", "吉祥航空": "603885", "元祖股份": "603886", "城地股份": "603887", "新华网": "603888", "新澳股份": "603889", "春秋电子": "603890", "瑞芯微": "603893", "天永智能": "603895", "寿仙谷": "603896", "长城科技": "603897", "好莱客": "603898", "晨光文具": "603899", "莱绅通灵": "603900", "永创智能": "603901", "中持股份": "603903", "龙蟠科技": "603906", "牧高笛": "603908", "合诚股份": "603909", "佳力图": "603912", "国茂股份": "603915", "苏博特": "603916", "合力科技": "603917", "金桥信息": "603918", "金徽酒": "603919", "世运电路": "603920", "金鸿顺": "603922", "铁流股份": "603926", "中科软": "603927", "兴业股份": "603928", "亚翔集成": "603929", "格林达": "603931", "睿能科技": "603933", "博敏电子": "603936", "丽岛新材": "603937", "三孚股份": "603938", "益丰药房": "603939", "建业股份": "603948", "雪龙集团": "603949", "长源东谷": "603950", "大千生态": "603955", "威派格": "603956", "哈森股份": "603958", "百利科技": "603959", "克来机电": "603960", "大理药业": "603963", "法兰泰克": "603966", "中创物流": "603967", "醋化股份": "603968", "银龙股份": "603969", "中农立华": "603970", "正川股份": "603976", "国泰集团": "603977", "深圳新星": "603978", "金诚信": "603979", "吉华集团": "603980", "泉峰汽车": "603982", "丸美股份": "603983", "恒润股份": "603985", "兆易创新": "603986", "康德莱": "603987", "中电电机": "603988", "艾华集团": "603989", "麦迪科技": "603990", "至正股份": "603991", "松霖科技": "603992", "洛阳钼业": "603993", "甬金股份": "603995", "*ST中新": "603996", "继峰股份": "603997", "方盛制药": "603998", "读者传媒": "603999", "威奥股份": "605001", "长鸿高科": "605008", "天正电气": "605066", "冠盛股份": "605088", "华丰股份": "605100", "同庆楼": "605108", "力鼎光电": "605118", "派克新材": "605123", "华达新材": "605158", "聚合顺": "605166", "三人行": "605168", "时空科技": "605178", "国光连锁": "605188", "葫芦娃": "605199", "起帆电缆": "605222", "天普股份": "605255", "凯迪股份": "605288", "法狮龙": "605318", "沪光股份": "605333", "宏柏新材": "605366", "均瑶健康": "605388", "晨光新材": "605399", "华兴源创": "688001", "睿创微纳": "688002", "天准科技": "688003", "博汇科技": "688004", "容百科技": "688005", "杭可科技": "688006", "光峰科技": "688007", "澜起科技": "688008", "中国通号": "688009", "福光股份": "688010", "新光光电": "688011", "中微公司": "688012", "交控科技": "688015", "心脉医疗": "688016", "乐鑫科技": "688018", "安集科技": "688019", "方邦股份": "688020", "奥福环保": "688021", "瀚川智能": "688022", "安恒信息": "688023", "杰普特": "688025", "洁特生物": "688026", "国盾量子": "688027", "沃尔德": "688028", "南微医学": "688029", "山石网科": "688030", "天宜上佳": "688033", "传音控股": "688036", "芯源微": "688037", "当虹科技": "688039", "爱博医疗": "688050", "佳华科技": "688051", "龙腾光电": "688055", "宝兰德": "688058", "云涌科技": "688060", "凯赛生物": "688065", "航天宏图": "688066", "热景生物": "688068", "德林海": "688069", "大地熊": "688077", "龙软科技": "688078", "映翰通": "688080", "兴图新科": "688081", "三友医疗": "688085", "紫晶存储": "688086", "虹软科技": "688088", "嘉必优": "688089", "瑞松科技": "688090", "京源环保": "688096", "申联生物": "688098", "晶晨股份": "688099", "威胜信息": "688100", "三达膜": "688101", "金宏气体": "688106", "赛诺医疗": "688108", "金山办公": "688111", "天奈科技": "688116", "普元信息": "688118", "西部超导": "688122", "聚辰股份": "688123", "沪硅产业": "688126", "中国电研": "688128", "清溢光电": "688138", "海尔生物": "688139", "先惠技术": "688155", "松井股份": "688157", "优刻得": "688158", "有方科技": "688159", "埃夫特": "688165", "博瑞医药": "688166", "安博通": "688168", "石头科技": "688169", "百奥泰": "688177", "万德斯": "688178", "君实生物": "688180", "八亿时空": "688181", "康希诺": "688185", "广大特材": "688186", "柏楚电子": "688188", "南新制药": "688189", "卓越新能": "688196", "佰仁医疗": "688198", "久日新材": "688199", "华峰测控": "688200", "美迪西": "688202", "道通科技": "688208", "江苏北人": "688218", "成都先导": "688222", "开普云": "688228", "博睿数据": "688229", "神工股份": "688233", "寒武纪": "688256", "卓易信息": "688258", "泽璟制药": "688266", "华特气体": "688268", "天智航": "688277", "特宝生物": "688278", "敏芯股份": "688286", "鸿泉物联": "688288", "东方生物": "688298", "长阳科技": "688299", "联瑞新材": "688300", "恒誉环保": "688309", "迈得医疗": "688310", "盟升电子": "688311", "燕麦科技": "688312", "仕佳光子": "688313", "财富趋势": "688318", "微芯生物": "688321", "铂力特": "688333", "复洁环保": "688335", "三生国健": "688336", "赛科希德": "688338", "亿华通": "688339", "建龙微纳": "688357", "祥生医疗": "688358", "德马科技": "688360", "华熙生物": "688363", "光云科技": "688365", "昊海生科": "688366", "晶丰明源": "688368", "致远互联": "688369", "迪威尔": "688377", "华光新材": "688379", "嘉元科技": "688388", "普门科技": "688389", "安必平": "688393", "华润微": "688396", "赛特新材": "688398", "硕世生物": "688399", "震有科技": "688418", "金科环境": "688466", "艾迪药业": "688488", "慧辰资讯": "688500", "复旦张江": "688505", "芯朋微": "688508", "奥特维": "688516", "联赢激光": "688518", "南亚新材": "688519", "神州细胞": "688520", "芯原股份": "688521", "秦川物联": "688528", "泽达易盛": "688555", "高测股份": "688556", "国盛智科": "688558", "奇安信": "688561", "吉贝尔": "688566", "孚能科技": "688567", "中科星图": "688568", "山大地纬": "688579", "伟思医疗": "688580", "江航装备": "688586", "凌志软件": "688588", "力合微": "688589", "正帆科技": "688596", "金博股份": "688598", "天合光能": "688599", "皖仪科技": "688600", "中芯国际": "688981"};
let token = "Bearer eyJhbGciOiJIUzUxMiJ9.eyJ3eFVzZXJJZCI6MTA3NDk5NSwic3ViIjoiMTA3NDk5NSIsIm1vYmlsZVBob25lIjoiMTM0ODI4OTI2MTIiLCJjaGFubmVsIjoiUEMiLCJleHAiOjE2MDE5OTE3NTMsImlhdCI6MTU5OTM5OTc1M30._dLtoanU_FoZ03XAiXVj3kgqeplQF1qSsuLC-SVFOJ7K8mfCzis0nr1nQqyiYaRMFVBWlZi-uKPt4a1YRT1Ctg";

class GubangPage extends React.Component {

    constructor(props) {
        super(props);
    }

    render() {
        return (
            <div className='GubangPage'>
                <span>
                    <h2>股帮，预期差就是生产力</h2>
                    <div className="SubPage">
                        <GubangInfoList />
                    </div>
                </span>
            </div>
        )
    }
}

class GubangInfoList extends React.Component {

    constructor(props) {
        super(props);
        this.state = {
            data: [],
            page: 1,
            totalPages: 0,
            needPre: false,
            needNext: true,
            renderDetail: false,
            renderZlIdList: false,
            renderHackPage: false,
            renderStockPage: false,
            zlId: null,
            detailData: {},
            filter: "all",
            needAlert: false,
            hackStockList: [],
            code: ""
        };
        this.handleFilter = this.handleFilter.bind(this);
        this.getList(this.state.page)
    }

    loadStorage(key) {
        let storage=window.localStorage;
        if (storage.hasOwnProperty(key)) {
            return storage[key]
        }
        return null;
    }

    saveStorage(key, value) {
        let storage=window.localStorage;
        storage[key] = value
    }

    async getList(pageNum) {
        if (this.state.renderZlIdList) {
            this.getZlIdList(pageNum, this.state.zlId)
        } else {
            this.getAllList(pageNum)
        }
    }

    async getAllList(pageNum) {
        try {
            let response = await fetch(listAllUrl+"&pageNum="+pageNum);
            let map = await response.json();
            this.setState({data: map["data"]["records"]});
            this.setState({totalPages: map["pages"]});
            if (pageNum === 1) {
                let latestList = [];
                map["data"]["records"].forEach((v, i) => {
                   latestList.push(v["subjectId"])
                });
                this.saveStorage("latest_list", JSON.stringify(latestList))
            }
        } catch(e) {
            console.log("Oops, error", e);
        }
    }

    async compareAndRefreshAllList() {
        try {
            let response = await fetch(listAllUrl+"&pageNum=1");
            let map = await response.json();
            let latestListStr = this.loadStorage("latest_list");
            let latestList = JSON.parse(latestListStr);
            let newList = [];
            map["data"]["records"].forEach((v, i) => {
                newList.push(v["subjectId"])
            });
            this.setState({data: map["data"]["records"]});
            this.setState({totalPages: map["pages"]});
            this.saveStorage("latest_list", JSON.stringify(newList))
            if (newList.toString() !== latestList.toString()) {
                this.setState({
                    needAlert: true
                });
            }
        } catch(e) {
            console.log("Oops, error", e);
        }
    }

    async getZlIdList(pageNum, zlId) {
        try {
            let response = await fetch(listZlIdUrl+"&pageNum="+pageNum+"&zlId="+zlId);
            let map = await response.json();
            this.setState({data: map["data"]["records"]});
            this.setState({totalPages: map["pages"]})
        } catch(e) {
            console.log("Oops, error", e);
        }
    }

    async returnZlIdList(pageNum, zlId) {
        try {
            let response = await fetch(listZlIdUrl+"&pageNum="+pageNum+"&zlId="+zlId);
            let map = await response.json();
            return map["data"]["records"];
        } catch(e) {
            console.log("Oops, error", e);
            return []
        }
    }

    renderList() {
        var listElements=[];
        this.state.data.forEach((record)=>{
            let content = record["content"] === "" ? record["summary"]: record["content"];
            listElements.push(
                <p>
                    {record["title"]}<sub style={{color: zlColorMap[record["zlName"]]}}>{record["zlName"]}</sub><br/>
                    <div className='Snapshot'>
                        {content}<br/>
                        <div style={{color:"gray", fontSize: 5}}>
                            {record["upTime"]}
                            <button className="NaviDetailBtn" onClick={() => this.clickDetail(record["type"], record["subjectId"])}>详情</button>
                        </div>
                        <br/>
                    </div>
                </p>
            )
        });
        return listElements;
    }

    async clickDetail(type, id) {
        try {
            let response = await fetch("https://admin.gbhome.com/api/common/" + type + "/detail/" + id, {headers:{"authorization":token}});
            let map = await response.json();
            this.setState({
                detailData: map["data"],
                renderDetail: true
            })
        } catch(e) {
            console.log("Oops, error", e);
        }
    }

    async returnDetail(type, id) {
        try {
            let response = await fetch("https://admin.gbhome.com/api/common/" + type + "/detail/" + id, {headers:{"authorization":token}});
            let map = await response.json();
            return map["data"]
        } catch(e) {
            console.log("Oops, error", e);
        }
    }

    backToList() {
        this.setState({
            renderDetail: false,
        })
    }

    renderDetail() {
        let details = [];
        details.push(<button className="BackButton" onClick={() => this.backToList()}>{"<"}返回</button>);
        if (this.state.detailData.hasOwnProperty("zlArticle")) {
            details.push(<div dangerouslySetInnerHTML={{__html: this.state.detailData["zlArticle"]["detail"]}}/>);
        } else if (this.state.detailData.hasOwnProperty("zlTrendsDto")) {
            details.push(<div>{this.state.detailData["zlTrendsDto"]["content"]}</div>)
            if (this.state.detailData["zlTrendsDto"]["trendsImgList"] !== null) {
                this.state.detailData["zlTrendsDto"]["trendsImgList"].forEach((item, index) => {
                    details.push(<img src={item["imgSrc"]}></img>)
                });
            }
        } else if (this.state.detailData.hasOwnProperty("zlQuestion")) {
            details.push(<div>
                <h2>{this.state.detailData["zlQuestion"]["detail"]}</h2>
                <p>{this.state.detailData["zlAnswersDtoPage"]["records"][0]["content"]}</p>
            </div>)
        }
        details.push(<button className="BackButton" onClick={() => this.backToList()}>{"<"}返回</button>);
        return (
            details
        )
    }

    // ----------------------Hack Page Block----------------------------
    findStockNumList(content) {
        let result = [];
        allStockNames.forEach(name => {
            if (content.indexOf(name) > -1) {
                result.push(name)
            }
        });
        return result;
    }

    async reptileStock() {
        // let yanjiuyuanList = await this.returnZlIdList(1, 1000007);
        let yanbaoList = await this.returnZlIdList(1, 1000003);
        let youziList = await this.returnZlIdList(1, 1000004);
        let allList = [];
        // allList = allList.concat(yanjiuyuanList);
        allList = allList.concat(yanbaoList);
        allList = allList.concat(youziList);
        let stockList = [];
        let put = [];
        allList.forEach((data) => {
            this.putIntoStockList(data, stockList, put, allList.length)
        });

    }

    async putIntoStockList(record, stockList, put, max) {
        let detail = await this.returnDetail(record["type"], record["subjectId"]);
        if (detail === null) {
            return
        }
        let k = "zlArticle";
        let k2 = "detail";
        if (detail.hasOwnProperty("zlTrendsDto")) {
            k = "zlTrendsDto";
            k2 = "content"
        }
        if (detail.hasOwnProperty("zlQuestion")) {
            k = "zlQuestion"
        }
        let content = detail[k][k2];
        let stocks = this.findStockNumList(content);
        if (stocks != null) {
            stocks.forEach(stock => {
                stockList.push(this.createStockInfo(stock, detail[k]["createTime"], record["type"], zlIdMap[record["zlId"]], detail[k]["title"],
                    record["type"], record["subjectId"]));
                stockList = stockList.sort(function(a,b){return b.time > a.time ? 1: -1});
            })
        }
        put.push("x");
        if (put.length === max) {
            this.setState({
                hackStockList: stockList,
                renderHackPage: true
            });
        }
    }

    createStockInfo(stock, time, from, zl, title, type, subjectId) {
        let o = new Object();
        o.stock = stock;
        o.time = time;
        o.from = from;
        o.zl = zl;
        o.title = title;
        o.type = type;
        o.subjectId = subjectId;
        return o;
    }

    renderHack() {
        var listElements=[];
        listElements.push(<button className="BackButton" onClick={() => this.exitHack()}>{"<"}返回</button>);
        listElements.push(<h4>股帮提及股票列表</h4>);
        let stockList = this.state.hackStockList;
        for(let i=0;i < stockList.length; i++) {
            let info = stockList[i];
            listElements.push(
                <p>
                    股票名称: {info.stock}； 股票代码: {allStockMap[info.stock]}； 提及时间: {info.time}； 来源: {info.zl} <br/>
                    <sub style={{color: "gray"}}>来自: {info.title}</sub><button className="NaviDetailBtn" onClick={() => this.clickDetail(info.type, info.subjectId)}>详情</button>
                    {this.renderSpecificStockPage(allStockMap[info.stock])}
                </p>
            )
        }
        return listElements;
    }

    exitHack() {
        this.setState({
            renderHackPage: false
        })
    }

    // -----------------------------------------------------------------

    renderStockPage() {
        let code = this.state.code;
        return(
            <div>
                <button className="BackButton" onClick={() => this.existStockPage()}>{"<"}返回</button>
                <br/>
                <GubangStockPage code={code} />
            </div>
        )
    }

    renderSpecificStockPage(code) {
        return(
            <div>
                <button className="BackButton" onClick={() => this.existStockPage()}>{"<"}返回</button>
                <br/>
                <GubangStockPage code={code} />
            </div>
        )
    }

    enterStockPage(code) {
        setTimeout(() => {
            this.setState({
                code: code,
                renderStockPage: true
            })
        }, 0)
    }

    existStockPage() {
        this.setState({
            renderStockPage: false
        })
    }

    nextPage() {
        let curPage = this.state.page + 1;
        this.setState({
            page: curPage
        });
        this.getList(curPage);
        this.refreshPageChanger(curPage)
    }

    prePage() {
        let curPage = this.state.page - 1;
        this.setState({
            page: curPage
        });
        this.getList(curPage);
        this.refreshPageChanger(curPage)
    }

    refreshPageChanger(curPage) {
        if (curPage === 1) {
            this.setState({needPre: false})
        } else {
            this.setState({needPre: true})
        }
    }

    renderPageChanger() {
        let result = [];
        if (this.state.needPre) {
            result.push(<button className="PageButton" onClick={() => this.prePage()}>上一页</button>)
        }
        if (this.state.needNext) {
            result.push(<button className="PageButton" onClick={() => this.nextPage()}>下一页</button>)
        }
        return result
    }

    handleFilter(e) {
        this.setState({
            page: 1
        });
        if (e.target.value === "全部") {
            this.setState({
                    renderZlIdList: false
            });
            this.getAllList(1)
        } else {
            this.setState({
                renderZlIdList: true,
                zlId: e.target.value
            });
            this.getZlIdList(1, e.target.value)
        }
    }

    render() {
        if (this.state.renderDetail) {
            return (
                <div className="PageDetail">
                    {this.renderDetail()}
                </div>
            )
        }
        if (this.state.renderStockPage) {
            return setTimeout(() => {
                return this.renderStockPage()
            }, 0)
            // return this.renderStockPage()
        }
        if (this.state.renderHackPage) {
            return (
                <div className="HackDetail">
                    {this.renderHack()}
                </div>
            )
        }
        return (
            <div>
                <button className="BackButton" onClick={() => this.getList(this.state.page)}>刷新</button>
                <select onChange={this.handleFilter}>
                    <option value="全部">全部</option>
                    <option value="1000003">独家研报</option>
                    <option value="1000004">游资锦囊</option>
                </select>
                <button className="BackButton" onClick={() => this.reptileStock()}>Hack</button>
                {this.renderList()}
                <div>
                    [第{this.state.page}页] {this.renderPageChanger()}
                </div>
            </div>
        );
    }

    componentDidMount(){
        this.timer=setInterval(()=>{ // 轮询
            this.compareAndRefreshAllList();
            if (this.state.needAlert) {
                this.setState({
                    needAlert: false
                });
                Notification.requestPermission();// 获取通知权限
                if (Notification.permission === "granted") {// denied (用户拒绝了通知的显示), granted (用户允许了通知的显示),
                    let notice = new Notification("Jarvis Notice", {
                        body : "股帮更新啦~",
                        silent:true,//通知是否静音，默认false，表示无声
                        renotify:false,//新通知是否覆盖旧的通知，默认为true，表示永远只显示一条通知；false不覆盖会多条通知叠加
                        requireInteraction: true, // 不自动关闭通知知道用户点击或关闭，默认false
                        sticky: true,//一个 Boolean 指明通知是否应该是“粘”, 即不易被用户清理。默认值为false，这意味着它不会粘。
                    });
                    notice.onshow = function () {
                        // do something
                    };
                    notice.onclick = function () {
                        window.focus();//这里是可以让浏览器到页面最顶层,并且浏览器显示消息页面tab(前提是当前页面没有关闭)
                        notice.close();
                    };
                    notice.onerror = function (err) {
                        // do something
                    };
                    notice.onclose = function () {
                        // do something
                    }
                }else if(Notification.permission === "denied"){
                    clearInterval(this.timer);
                }
            }
        },20000 + Math.floor(Math.random()*10000))
    }
    componentWillUnmount(){
        if(this.timer !== null) {
            clearInterval(this.timer);
        }
    }
}

class GubangStockPage extends React.Component {
    constructor(props) {
        super(props);
        this.state = {
            code: this.props.code,
            times: [],
            valueList: [],
            ma5: [],
            ma10: [],
            ma20: [],
            ma30: [],
            kTitle: "未知",
            type: "day"
        };
        this.getData(this.state.code, this.state.type);
        this.changeCode = this.changeCode.bind(this)
        this.changeType = this.changeType.bind(this)
    }

    loadStorage(key) {
        let storage=window.localStorage;
        if (storage.hasOwnProperty(key)) {
            console.log(key + ":" + storage[key]);
            return storage[key]
        }
        return null;
    }

    saveStorage(key, value) {
        let storage=window.localStorage;
        storage[key] = value
    }

    getTimes(kList) {
        let times = [];
        kList.forEach((raw) => {
            times.push(raw["time"])
        });
        return times.reverse();
    }

    getValueList(kList) {
        let list = [];
        kList.forEach((raw) => {
            list.push([
                parseFloat(raw["open"]),
                parseFloat(raw["close"]),
                parseFloat(raw["min"]),
                parseFloat(raw["max"])])
        });
        return list.reverse();
    }

    calculateMA(kList, dayCount) {
        let result = [];
        let valueList = this.getValueList(kList);
        for (let i = 0, len = valueList.length; i < len; i++) {
            if (i < dayCount) {
                result.push('-');
                continue;
            }
            let sum = 0;
            for (let j = 0; j < dayCount; j++) {
                sum += valueList[i - j][1];
            }
            result.push(sum / dayCount);
        }
        return result;
    }

    getTimeByType(type) {
        if (type === "week") {
            return moment().add("year", -1).format("yyyyMMDD");
        }
        if (type === "month") {
            return moment().add("year", -2).format("yyyyMMDD");
        }
        return moment().add("month", -6).format("yyyyMMDD");
    }

    async getData(code, type) {
        try {
            let begin = this.getTimeByType(type);
            let response = await fetch(dataUrl+"beginDay="+begin+"&code="+code+"&time="+type,
                {headers:{"Authorization":appCode}});
            let map = await response.json();
            let kList = map["showapi_res_body"]["dataList"];
            this.setState({
                times: this.getTimes(kList),
                valueList: this.getValueList(kList),
                ma5: this.calculateMA(kList, 5),
                ma10: this.calculateMA(kList, 10),
                ma20: this.calculateMA(kList, 20),
                ma30: this.calculateMA(kList, 30),
                kTitle: map["showapi_res_body"]["name"]
            });
        } catch(e) {
            console.log("Oops, error", e);
        }
    }

    changeCode(e) {
        this.setState({
            code: e.target.value
        });
        this.saveStorage("code", e.target.value);
        this.getData(e.target.value, this.state.type)
    }

    changeType(e) {
        this.setState({
            type: e.target.value
        });
        this.getData(this.state.code, e.target.value)
    }

    render(){
        return(
            <div className="GubangStockPage">
                <div className='StockDetail' style={{height:'45vh',width:'80vh'}}>
                    <div className="StockCodeInput">
                        股票代码 <input onBlur={this.changeCode} type='text'/>
                        <label><input name="timeType" type="radio" value="day" onClick={this.changeType} defaultChecked="checked"/>日K </label>
                        <label><input name="timeType" type="radio" value="week" onClick={this.changeType}/>周K </label>
                        <label><input name="timeType" type="radio" value="month" onClick={this.changeType}/>月K </label>
                    </div>
                    <div className="ChartColumn">
                        <ReactEcharts className="StockChart" option={this.getOption()} style={{height:'40vh',width:'60vh'}} theme="Imooc"/>
                    </div>
                </div>
            </div>
        )
    }

    getOption =()=> {
        let option = {
            title: {
                text: this.state.kTitle,
                left: 0
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: {
                    type: 'cross'
                }
            },
            legend: {
                data: ['K', 'MA5', 'MA10', 'MA20', 'MA30', 'BI']
            },
            grid: {
                left: '10%',
                right: '10%',
                bottom: '15%'
            },
            xAxis: {
                type: 'category',
                data: this.state.times,
                scale: true,
                boundaryGap: false,
                axisLine: {onZero: false},
                splitLine: {show: false},
                splitNumber: 20,
                min: 'dataMin',
                max: 'dataMax'
            },
            yAxis: {
                scale: true,
                splitArea: {
                    show: true
                }
            },
            dataZoom: [
                {
                    type: 'inside',
                    start: 50,
                    end: 100,
                },
                {
                    show: true,
                    type: 'slider',
                    top: '90%',
                    start: 50,
                    end: 100
                }
            ],
            series: [
                {
                    name: 'K',
                    type: 'candlestick',
                    data: this.state.valueList,
                    itemStyle: {
                        color: 'rgba(0,0,0,0)',
                        color0: 'rgba(0,0,0,0)',
                        borderColor: upColor,
                        borderColor0: downColor,
                        borderWidth:1.15
                    },
                    markPoint: {
                        label: {
                            normal: {
                                formatter: function (param) {
                                    return param != null ? Math.round(param.value) : '';
                                }
                            }
                        },
                        data: [
                            {
                                name: 'highest value',
                                type: 'max',
                                valueDim: 'highest'
                            },
                            {
                                name: 'lowest value',
                                type: 'min',
                                valueDim: 'lowest'
                            },
                            {
                                name: 'average value on close',
                                type: 'average',
                                valueDim: 'close'
                            }
                        ],
                        tooltip: {
                            formatter: function (param) {
                                return param.name + '<br>' + (param.data.coord || '');
                            }
                        }
                    },
                    markLine: {
                        symbol: ['none', 'none'],
                        data: [
                            [
                                {
                                    name: 'from lowest to highest',
                                    type: 'min',
                                    valueDim: 'lowest',
                                    symbol: 'circle',
                                    symbolSize: 10,
                                    label: {
                                        show: false
                                    },
                                    emphasis: {
                                        label: {
                                            show: false
                                        }
                                    }
                                },
                                {
                                    type: 'max',
                                    valueDim: 'highest',
                                    symbol: 'circle',
                                    symbolSize: 10,
                                    label: {
                                        show: false
                                    },
                                    emphasis: {
                                        label: {
                                            show: false
                                        }
                                    }
                                }
                            ],
                            {
                                name: 'min line on close',
                                type: 'min',
                                valueDim: 'close'
                            },
                            {
                                name: 'max line on close',
                                type: 'max',
                                valueDim: 'close'
                            }
                        ]
                    }
                },
                {
                    name: 'MA5',
                    type: 'line',
                    data: this.state.ma5,
                    xAxisIndex: 0,
                    smooth: true,
                    lineStyle: {
                        opacity: 0.5
                    },
                    symbolSize: 0.5
                },
                {
                    name: 'MA10',
                    type: 'line',
                    data: this.state.ma10,
                    smooth: true,
                    lineStyle: {
                        opacity: 0.5
                    },
                    symbolSize: 0.5
                },
                {
                    name: 'MA20',
                    type: 'line',
                    data: this.state.ma20,
                    smooth: true,
                    lineStyle: {
                        opacity: 0.5
                    },
                    symbolSize: 0.5
                },
                {
                    name: 'MA30',
                    type: 'line',
                    data: this.state.ma30,
                    smooth: true,
                    lineStyle: {
                        opacity: 0.5
                    },
                    symbolSize: 0.5
                }/*,
                {
                    name: 'BI',
                    type: 'line',
                    data: biData,
                    smooth: false,
                    lineStyle: {
                        opacity: 1,
                        color: 'red'
                    },
                    symbolSize: 0.5,
                    connectNulls: true
                },
                {
                    name: 'XD',
                    type: 'line',
                    data: xdData,
                    smooth: false,
                    lineStyle: {
                        opacity: 1,
                        color: 'blue',
                        type:'dotted'
                    },
                    symbolSize: 0.5,
                    connectNulls: true
                },*/
            ]
        };
        return option
    }
}

export default GubangPage;